{"url": "https://finance.yahoo.com/news/1-u-n-mulls-sending-124323432.html", "title": "UPDATE 1-As U.N. mulls sending troops to Haiti, a gang's rise shows how hard that would be", "summary": "As Haiti's gang-induced humanitarian crisis deepened in October, a group of looters ransacked a supermarket in a well-to-do suburb of the capital Port-au-Prince, leading police to arrest over a dozen people and take them to a nearby police station.  Within hours, the station in the area known as Thomassin came under a hail of bullets from gang members led by a man named Carlo Petithomme, whose brother had been among those arrested, according to two security sources.  Petithomme goes by the alias Ti Makak, and leads a gang of the same name.", "date": 1667047403000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/britain-denies-russian-claims-navy-124711989.html", "title": "Britain denies Russian claims that its navy personnel blew up Nord Stream gas pipelines", "summary": "Britain on Saturday denied Russian claims that British navy personnel blew up the Nord Stream gas pipelines last month, calling them \"false claims of an epic scale\".  \"To detract from their disastrous handling of the illegal invasion of Ukraine, the Russian Ministry of Defence is resorting to peddling false claims of an epic scale,\" a spokesperson for Britain's ministry of defence said.", "date": 1667047631000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-says-uk-navy-110522580.html", "title": "UPDATE 4-Russia says UK navy blew up Nord Stream, London denies involvement", "summary": "Russia's defence ministry said on Saturday that British navy personnel blew up the Nord Stream gas pipelines last month, a claim that London said was false and designed to distract from Russian military failures in Ukraine.  Russia did not give evidence for its claim that a leading NATO member had sabotaged critical Russian infrastructure amid the worst crisis in relations between the West and Russia since the depths of the Cold War.", "date": 1667041522000, "category": "World", "tickers": ["NG=F"]}
{"url": "https://finance.yahoo.com/news/twitter-frees-billions-arbitrage-traders-121500535.html", "title": "Twitter Frees Up Billions for Arbitrage Traders Seeking Next Win", "summary": "(Bloomberg) -- Billions of dollars in arbitrage capital is looking for a new home after Elon Musk finally closed his $44 billion deal to buy Twitter Inc.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainTwitter CEO Among Top Executives Departing as Musk Takes OverFed Seen Aggressively Hiking to 5%, Triggering Global RecessionMerger", "date": 1667045700000, "category": "Business", "tickers": ["TWTR", "VMW", "ATVI", "MSFT"]}
{"url": "https://finance.yahoo.com/news/ukraine-questions-twitter-takeover-amid-142107523.html", "title": "Ukraine questions Twitter takeover amid precarious ties with Musk", "summary": "A senior Ukrainian official expressed scepticism on Saturday about the takeover of Twitter by Elon Musk, whose relations with Kyiv have been precarious since the billionaire suggested in early October Ukraine should give up occupied land for peace.  Musk, a self-declared \"free speech absolutist\", has expressed desire to shake up Twitter's content moderation, and tweeted that \"the bird is freed\" after completing the purchase.  He pointed to Musk's \"unusual moderation\" of the site.", "date": 1667053267000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/microbetting-mlb-engage-fans-in-new-ways-142059807.html", "title": "'Holy grail': Microbetting is helping the MLB engage fans in new ways", "summary": "Microbetting, the practice of wagering on the outcome of a minor portion of a game like a specific pitch being a ball or strike, is surging in baseball.", "date": 1667053259000, "category": "Sports", "tickers": ["DKNG"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Says UK Involved in Naval Vessel Strike", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia’s Defense Ministry said a navy minesweeper received minor damage from a “massive” drone strike on its Black Sea fleet in Crimea, and accu", "date": 1667053924000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/strong-dollar-seen-hurting-us-131500648.html", "title": "Strong Dollar Seen Hurting US Outlook and Even Tilting Fed Path", "summary": "(Bloomberg) -- A strong dollar is likely to weigh negatively on the US economic outlook and could alter how high the Federal Reserve ultimately raises interest rates, economists surveyed by Bloomberg said.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Amo", "date": 1667049300000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Grain Safe-Transit Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will halt its participation in the safe-transit deal for Ukrainian grain exports from three Black Sea ports, Interfax reported, citing a", "date": 1667055603000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/tesla-and-argo-ai-setbacks-sap-momentum-for-driverless-tech-145810140.html", "title": "Tesla and Argo AI setbacks sap momentum for driverless tech", "summary": "Pump the brakes. Take the air out of the tires. Stuck in reverse.\nWhatever automotive cliche you want to use, this week the driverless tech industry took a big blow.", "date": 1667055490000, "category": "Business", "tickers": ["F", "GM", "TSLA", "GOOG", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 1-Russia suspends participation in deal on Ukraine grain exports", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports following attacks on ships in Crimea, TASS quoted the defence ministry as saying on Saturday.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the \"grain corridor\", the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/u-n-touch-russia-ukraine-151557251.html", "title": "U.N. in touch with Russia about Ukraine grain deal suspension", "summary": "The United Nations is in contact with Russian authorities following reports Moscow has suspended participation in a deal that resumed Ukrainian Black Sea grain and fertilizer exports, a U.N. spokesman said on Saturday.  \"It is vital that all parties refrain from any action that would imperil the Black Sea Grain Initiative which is a critical humanitarian effort that is clearly having a positive impact on access to food for millions of people around the world,\" U.N. spokesman Stephane Dujarric said.", "date": 1667056557000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 2-Russia suspends participation in Ukraine grain exports deal", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports after attacks on ships in Crimea, Russia's defence ministry said on Saturday, dealing a blow to a three-month agreement aimed at easing a global squeeze on grain supplies.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the 'grain corridor', the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 3-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsular with 16 drones in the early hours of Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/biden-cast-early-vote-along-163347997.html", "title": "Biden to cast early vote, along with granddaughter, a first-time voter", "summary": "U.S. President Joe Biden will cast an early vote in the crucial Nov 8 midterm elections on Saturday, joined by his granddaughter Natalie, a first-time voter, as Democrats fight for every vote.  Polls suggest Democrats could lose control of both houses of Congress, with voter discontent over high inflation spoiling the momentum Democrats had hoped to win from a bitter fight with Repubicans over abortion rights.  Voter turnout - usually far lower in midterm elections than in presidential ballot years - will be a critical factor in battleground states, and Democrats are urging voters to cast their ballots early.", "date": 1667061227000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Black Sea Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667061825000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 3-At least 59 dead, 150 injured in Halloween stampede in South Korea", "summary": "At least 59 people were killed and 150 injured in a stampede after a crowd poured into a central district of the South Korean capital Seoul for Halloween festivities on Saturday night, a fire official said.  A large number of people fell down in a narrow alley during the Halloween events, Choi Sung-beom, head of the Yongsan Fire Station, said.  \"The area is still chaotic so we are still trying to figure out the exact number of people injured,\" Moon Hyun-joo, an official at the National Fire Agency said.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ice-takes-11-billion-write-down-for-stake-in-crypto-platform-bakkt-175824568.html", "title": "ICE takes $1.1 billion write-down for stake in crypto platform Bakkt", "summary": "Intercontinental Exchange (ICE) is taking a $1.1 billion write off for its holdings of crypto platform Bakkt according to an SEC filing late Friday afternoon.", "date": 1667066304000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Good News: Bad S&P 500 Earnings Are Playing Into the Fed’s Hand", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-dogecoin-surges-elon-musks-184538315.html", "title": "UPDATE 1-Dogecoin surges on Elon Musk's Twitter deal", "summary": "The Tesla Inc CEO, a vocal proponent of cryptocurrencies, has heavily influenced prices of dogecoin and bitcoin.  Tesla started accepting dogecoin as payment for its merchandise early this year, and Musk's newly launched perfume brand can also be bought with dogecoin.", "date": 1667069138000, "category": "Business", "tickers": ["TSLA"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 4-At least 120 killed in Halloween stampede in South Korea", "summary": "At least 120 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 100 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 4-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsula with 16 drones early on Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Bad S&P 500 Earnings Are Playing Right Into the Fed’s Hands", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 5-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 6-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Condemned for Halting Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667073078000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 7-At least 146 killed in stampede at Halloween event in South Korea", "summary": "At least 146 people were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/russia-suspends-ukraine-grain-export-201215135.html", "title": "Russia Suspends Ukraine Grain Export Deal Indefinitely", "summary": "(Bloomberg) -- Russia pulled out of a deal to allow Ukrainian grain exports from Black Sea ports after drone strikes against its naval vessels, a move that threatens to exacerbate the global food crisis and send prices soaring again.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Glo", "date": 1667074335000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/russia-suspends-ukraine-grain-export-201215135.html", "title": "Russia Suspends Ukraine Grain Export Deal; Biden Slams Move", "summary": "(Bloomberg) -- Russia pulled out of a deal to allow Ukrainian grain exports from Black Sea ports after drone strikes against its naval vessels, a move that threatens to exacerbate the global food crisis and send prices soaring again.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Glo", "date": 1667076766000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/fed-boe-prepare-75-basis-200000212.html", "title": "Fed and BOE Prepare 75 Basis-Point Salvos on Inflation: Eco Week", "summary": "(Bloomberg) -- The Federal Reserve and the Bank of England may both unleash 75 basis-point interest-rate hikes in the coming days in a show of aggression toward inflation, even in the face of mounting recession risks.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwi", "date": 1667073600000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 5-Russia halts Ukraine Black Sea grain exports, Biden outraged", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  U.S. President Joe Biden denounced the move as \"purely outrageous\" and said it would increase starvation.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverPresident Joe Biden denounced Russia’s announcement that it was pulling out of a UN-brokered deal to allow the export of grain from Ukraine as “", "date": 1667077675000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 8-At least 149 killed in stampede at Halloween event in South Korea", "summary": "At least 149 people were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a nightlife area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/treasury-market-rally-faces-reality-200000035.html", "title": "Treasury Market Rally Faces Reality Check as Powell Sets Path", "summary": "(Bloomberg) -- The optimism that has crept into the US bond market is about to be put to the test. Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesFed Seen Aggressively Hiking to 5%, Triggering Global RecessionMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainTwitter CEO Among Top Executives Departing as Musk Takes OverThe Treasury market rallied this week, snapping a 12-week lo", "date": 1667073600000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-biden-casts-early-vote-215941277.html", "title": "UPDATE 1-Biden casts early vote, vows to visit more states in coming days", "summary": "U.S. President Joe Biden cast an early vote in the crucial Nov. 8 midterm elections on Saturday, joined by his granddaughter Natalie, a first-time voter, and said he would visit more states in coming days to help Democrats fight for every possible vote.  Polls suggest Democrats could lose control of both houses of Congress, with voter discontent over high inflation spoiling the momentum Democrats had hoped to win from a bitter fight with Republicans over abortion rights.  \"I'm feeling good,\" Biden told reporters after voting and speaking briefly with an elderly woman in a wheelchair.", "date": 1667080781000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 9-Halloween stampede in Seoul leaves at least 149 dead", "summary": "At least 149 people, mostly teenagers and young adults in their 20s, were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a nightlife area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 65 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/uk-companies-see-tough-conditions-230251317.html", "title": "UK companies see tough conditions enduring in months ahead: CBI", "summary": "British businesses think the gloom hanging over their prospects will persist in the coming months, according to an industry survey published on Sunday.  The Confederation of British Industry's (CBI) gauge of private sector growth in the three months to October rose to -15 from -19 in the three months to September, still in contraction territory.  For the next three months, services and distribution companies expect a further downturn, although manufacturers were more optimistic.", "date": 1667084571000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/traveller-fined-refused-entry-australia-234752858.html", "title": "Traveller fined, refused entry to Australia for 'significant' biosecurity breach", "summary": "An international traveller has been fined and refused entry to Australia after trying to bring meat into the country in what the government said on Sunday was a \"significant breach\" of biosecurity laws to protect Australia from foot and mouth disease.  In a statement, Agriculture Minister Murray Watt and Home Affairs Minister Clare O'Neil said the traveller had been fined $2,664 and blocked from entering Australia after attempting to bring 6 kilograms of meat products into the country.", "date": 1667087272000, "category": "World", "tickers": ["FC=F", "LC=F"]}
{"url": "https://finance.yahoo.com/news/china-southern-cancels-planned-return-235905890.html", "title": "China Southern cancels planned return of Boeing 737 MAX flights -website", "summary": "China Southern Airlines Co Ltd has cancelled plans for two Boeing Co 737 MAX flights on Sunday that would have represented the model's return to passenger flying in China after more than three years, according to the airline's website.  The 737 MAX was grounded in March 2019 following fatal crashes in Indonesia and Ethiopia but has returned to service around the world with the exception of China and Russia after modifications to the aircraft and pilot training.  China Southern had scheduled flights from its Guangzhou hub to Zhengzhou and Wuhan, Reuters reported on Thursday.", "date": 1667087945000, "category": "Business", "tickers": ["ZNH", "BA"]}
{"url": "https://finance.yahoo.com/news/yoon-declares-mourning-south-korea-013823920.html", "title": "Yoon declares mourning for South Korea after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims and wishes for a speedy recovery to the injured.  A huge crowd celebrating in the popular Itaewon district surged into an alley on Saturday night, emergency officials said, adding the death toll could rise.", "date": 1667093903000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 1-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"  Choi Sung-beom, head of the Yongsan Fire Station, said 151 deaths had been confirmed, including 19 foreigners.", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 2-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims, mostly teenagers and people in their 20s, and his wishes for a speedy recovery to the many injured.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/china-central-bank-reaffirms-step-032535002.html", "title": "China central bank reaffirms it will step up support for real economy", "summary": "China's central bank will step up credit support for the real economy while keeping the yuan basically steady, Governor Yi Gang said in comments published on Sunday, reaffirming the bank's existing policy objectives.  \"We will keep liquidity reasonably ample, increase credit support to the real economy,\" Yi was quoted by a central bank statement as saying during a parliament session on Friday.  \"Going forward, China has the conditions to maintain a normal monetary policy as long as possible and maintain the stability of the currency's value.\"", "date": 1667100335000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/musk-fired-twitter-execs-attempt-043616179.html", "title": "Musk fired Twitter execs in attempt to avoid payouts, layoffs planned - reports", "summary": "Twitter's new owner Elon Musk fired top executives in an effort to avoid hefty severance payouts, while lining up other layoffs as soon as Saturday to avoid stock grants due on Nov. 1, according to media reports on Saturday.  Musk fired Twitter Chief Executive Parag Agrawal, Chief Financial Officer Ned Segal and legal affairs and policy chief Vijaya Gadde on completion of a high-profile $44 billion buyout of the social media platform on Thursday, people familiar with the matter told Reuters.  He had accused them of misleading him and Twitter investors over the number of fake accounts on the platform.", "date": 1667104576000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-macaus-mgm-cotai-casino-041142200.html", "title": "UPDATE 2-Macau's MGM Cotai casino locked down after dealer COVID case - media", "summary": "Macau's MGM Cotai casino, operated by MGM China, was locked down on Sunday morning after a dealer was found to be infected with COVID-19 in the world's biggest gambling hub, local publication Inside Asian Gaming reported.  The closure deals a blow to casino operators who have already been grappling with COVID restrictions for more than two and a half years.  Government health workers were at the MGM Cotai site with noone allowed to enter or exit the building, Inside Asian Gaming said.", "date": 1667103102000, "category": "World", "tickers": ["MCHVY"]}
{"url": "https://finance.yahoo.com/news/chinese-cities-brace-wave-foxconn-065754121.html", "title": "Chinese cities brace for wave of Foxconn workers from COVID-hit Zhengzhou", "summary": "Cities in central China hastily drew up plans to isolate migrant workers fleeing to their hometowns from a vast assembly facility of iPhone maker Foxconn in COVID-hit Zhengzhou city, fearing the returnees may trigger coronavirus outbreaks.  Zhengzhou, capital of Henan province, reported 167 locally transmitted COVID-19 cases in the seven days to Oct. 29, up from 97 infections in the prior seven-day period.  Taiwan-based Foxconn, which has about 300,000 workers in Zhengzhou, has not disclosed the number of infected workers.", "date": 1667113074000, "category": "World", "tickers": ["2317.TW"]}
{"url": "https://finance.yahoo.com/news/south-korea-halloween-disaster-leaves-065518917.html", "title": "South Korea Halloween disaster leaves desperate families seeking word of missing", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  \"No one is telling me the truth,\" said Aby, who has lived in Seoul with her son for 18 years.", "date": 1667112918000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/goldman-sachs-now-sees-fed-055400433.html", "title": "Goldman Sachs Now Sees Fed Rates Peaking at 5% in March", "summary": "(Bloomberg) -- Goldman Sachs Group Inc. economists said they now expect the US Federal Reserve to raise interest rates to 5%, higher than previously predicted.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’The centr", "date": 1667109240000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/wrapup-1-russia-halts-ukraine-071902662.html", "title": "WRAPUP 1-Russia halts Ukraine Black Sea grain exports, prompting food crisis concerns", "summary": "Russia pulled out of a key United Nations-brokered grain deal, provoking international outrage and dealing a blow to attempts to ease a global food crisis triggered by Moscow's invasion of Ukraine.  On Saturday Moscow said it was suspending participation in the Black Sea deal, which has sought to avert famine and tame inflation, in response to what it called a major Ukrainian drone attack on its fleet.", "date": 1667114342000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/russia-scolds-u-over-grain-070802016.html", "title": "Russia scolds U.S. over grain deal remarks", "summary": "Russia's ambassador to Washington scolded the United States on Sunday for making what he said were false assertions about Moscow's decision to suspend its participation in a U.N.-brokered Black Sea grain deal.  \"Washington's reaction to the terrorist attack on the port of Sevastopol is truly outrageous,\" Ambassador Anatoly Antonov said on Telegram.  \"All the indications that the British military specialists were involved in organizing the massive strike with the use of drones, are disregarded,\" Antonov said.", "date": 1667113682000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-china-passes-womens-protection-074506474.html", "title": "UPDATE 1-China passes new women's protection law, revamped for first time in decades", "summary": "China passed legislation on Sunday aimed at giving women more protection against gender discrimination and sexual harassment, days after the bill was submitted to the country's top legislature after a third revision and extensive public input.  The legislation comes as activists have expressed concern about increasing government rhetoric on the value of traditional women's roles, and what some see as setbacks for women's rights and more restrictive attitudes towards abortion.  It's not yet clear to what extent those more conservative attitudes will be reflected in the new law.", "date": 1667115906000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-macaus-mgm-cotai-casino-041142200.html", "title": "UPDATE 3-Macau's MGM Cotai casino locked down with guests, staff after COVID case", "summary": "MGM China's Cotai casino in Macau was locked down on Sunday after a dealer tested positive for COVID-19, city authorities in the world's biggest gambling hub said, ordering everyone inside to stay put until Nov 1.  The closure deals a blow to casino operators who have already been grappling with COVID restrictions for more than two and a half years.  Government health workers were at the MGM Cotai site with noone allowed to enter or exit the building, industry publication Inside Asian Gaming said.", "date": 1667103102000, "category": "World", "tickers": ["MCHVY"]}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 3-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims, mostly teenagers and people in their 20s, and his wishes for a speedy recovery to the many injured in one of the South Korea's worst disasters and the world's worst stampedes in decades.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/goldman-sachs-sees-fed-rates-075832092.html", "title": "Goldman Sachs sees Fed rates peaking at 5% in March - Bloomberg News", "summary": "Goldman Sachs Group Inc's economists said the U.S. Federal Reserve could bump up interest rates to as high as 5% by March 2023, 25 basis points above its earlier predictions, Bloomberg News reported on Sunday.  Goldman Sachs Chief Executive Officer David Solomon last week said the U.S. Federal Reserve could hike rates beyond 4.5-4.75% if it does not see \"real changes in behaviour.\"  Federal Reserve's next meeting could shed light on how long it will stick to the aggressive monetary policies.", "date": 1667116712000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/halloween-parties-turned-deadly-popular-075522073.html", "title": "How Halloween parties turned deadly in popular Seoul district", "summary": "Young people flocking to Seoul's popular Itaewon district on Saturday for the first virtually unrestricted Halloween festivities in three years instead found themselves caught up in a deadly crush that killed at least 151 people.  The crowd of partiers, some still in their teens and many clad in Halloween costumes, was ready to enjoy the bars, nightclubs and restaurants where the revelry routinely spills over into narrow and often steep side streets.  But the intimacy of Itaewon's backstreets turned sinister this Halloween weekend.", "date": 1667116522000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/international-leaders-offer-condolences-over-080225419.html", "title": "International leaders offer condolences over deadly South Korea Halloween crush", "summary": "International leaders expressed condolences after at least 22 foreign nationals from 12 countries were among those killed in a deadly crowd surge in Seoul's Itaewon district, a popular nightlife spot for South Koreans and expatriates alike.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in the packed nightlife area.  At least four Chinese nationals were among those killed, Xinhua news agency reported, citing the Chinese embassy in Seoul.", "date": 1667116945000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Grain Prices Could Jump After Russian Deal Exit", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Kyiv’s allies, including the US, UK and EU, condemned Russia’s decision to exit a UN-brokered deal to allow the export of Ukrainian grain from three Blac", "date": 1667115784000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/eleven-participants-believed-taking-part-080410071.html", "title": "Eleven participants believed to be taking part in Iraq’s wheat tender - traders", "summary": "Eleven participants were believed to be taking part in Iraq’s tender for 50,000 tonnes of wheat, traders said on Sunday adding that no purchase was yet made.  Viterra  is among the participants.  Volumes in Iraq's tenders are nominal and the country often buys more than sought in the tender.", "date": 1667117050000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/1-south-korean-halloween-crush-083239840.html", "title": "UPDATE 1-After South Korean Halloween crush, families seek missing, plan funerals", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  One person broke down and kneeled on the floor after speaking to some officials at the centre, according to a Reuters witness.", "date": 1667118759000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-china-names-chen-yixin-083034539.html", "title": "UPDATE 1-China names Chen Yixin as state security minister -parliament", "summary": "China has appointed Chen Yixin as state security minister, replacing Chen Wenqing who was promoted to oversee police, legal affairs and intelligence, the National People's Congress, or parliament, said on Sunday.  Chen Yixin, who was elected to the ruling Communist Party's Central Committee during its once-every-five-years congress this month, had been in charge of a campaign in recent years to purge corrupt security and legal officials.  Chen Wenqing, who was elevated to the ruling Communist Party's Politburo, has been named as party secretary of the Central Political and Legal Affairs Commission, China's top security post with oversight of the police, judges and spies.", "date": 1667118634000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-halloween-parties-turned-deadly-090042808.html", "title": "UPDATE 1-How Halloween parties turned deadly in popular Seoul district", "summary": "Young people flocking to Seoul's popular Itaewon district on Saturday for the first virtually unrestricted Halloween festivities in three years instead found themselves caught up in a deadly crush that killed at least 151 people.  The crowd of partiers, some still in their teens and many clad in Halloween costumes, was ready to enjoy the bars, nightclubs and restaurants where the revelry routinely spills over into narrow and often steep side streets.  But the intimacy of Itaewon's backstreets turned sinister this Halloween weekend.", "date": 1667120442000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-international-leaders-offer-condolences-085529471.html", "title": "UPDATE 1-International leaders offer condolences over deadly South Korea Halloween crush", "summary": "International leaders expressed condolences after at least 22 foreign nationals from 13 countries were among those killed in a deadly crowd surge in Seoul's Itaewon district, a popular nightlife spot for South Koreans and expatriates alike.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 153 people in the packed nightlife area.  Those killed in Saturday night's disaster included people from China, Iran, Russia, the United States, Australia, Uzbekistan, Vietnam, Kazakhstan, Austria, Sri Lanka, Thailand, Norway and France, Yonhap news agency reported.", "date": 1667120129000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/eu-urges-moscow-revoke-suspension-085255863.html", "title": "EU urges Moscow to revoke suspension of Ukraine grain deal", "summary": "The European Union on Sunday called on Russia to reverse its decision to pull out of a U.N.-brokered deal that enabled Ukrainian grain exports via the Black Sea amid a global food crisis.  \"Russia's decision to suspend participation in the Black Sea deal puts at risk the main export route of much needed grain and fertilisers to address the global food crisis caused by its war against Ukraine,\" EU foreign policy chief Josep Borrell said on Twitter.", "date": 1667119975000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/seoul-crush-hits-storied-itaewon-092227869.html", "title": "Seoul crush hits storied Itaewon nightlife district on verge of renewal", "summary": "With \"Hooker Hill\" and snaking alleyways of bars with signs like \"BADASS\" around the local landmark Hamilton Hotel, Seoul's Itaewon district was a symbol of freewheeling nightlife in the South Korean capital for decades, before tragedy struck.  Lee Sang-yoon, who runs a pub in the alley next to the Hamilton where the disaster took place, said it may prove a devastating blow for even those who adapted to change.  \"This happened right at the moment when we were about to rebound after being hammered by the pandemic,\" said Lee, who has operated Itaewon businesses for three decades.", "date": 1667121747000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/cathay-pacific-resume-flights-using-091525365.html", "title": "Cathay Pacific to resume some flights using Russian airspace - Bloomberg News", "summary": "Cathay Pacific will fly from New York to the Asian financial hub using the so-called 'Polar Route' from Nov. 1, the report said citing an emailed response from the airline to the agency.  The report further added that airline cited strong headwinds and payload issues affecting its flights from the east coast of North America, and said its aircraft will overfly the far eastern part of Russia.  Cathay Pacific said in March that it was not routing flights through Russia's airspace, avoiding the area after the invasion of Ukraine despite longer flight times.", "date": 1667121325000, "category": "Business", "tickers": ["CPCAY"]}
{"url": "https://finance.yahoo.com/news/job-markets-defying-central-bankers-081500801.html", "title": "Job Markets Are Defying Central Bankers’ Efforts to Cool Demand", "summary": "(Bloomberg) -- Robust labor markets are defying central bankers’ efforts to tamp down inflation and economists’ predictions that recession is just around the corner.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’The", "date": 1667117700000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-korean-halloween-crush-083239840.html", "title": "UPDATE 2-After South Korean Halloween crush, families seek missing, plan funerals", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  One person broke down and kneeled on the floor after speaking to some officials at the centre, according to a Reuters witness.", "date": 1667118759000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-halloween-parties-turned-deadly-090042808.html", "title": "UPDATE 2-How Halloween parties turned deadly in Seoul's popular Itaewon district", "summary": "Young people flocking to Seoul's popular Itaewon district on Saturday for the first virtually unrestricted Halloween festivities in three years instead found themselves caught up in a deadly crush that killed at least 153 people.  The crowd of partiers, some still in their teens and many clad in Halloween costumes, was ready to enjoy the bars, nightclubs and restaurants where the revelry routinely spills over into narrow and often steep side streets.  But the intimacy of Itaewon's backstreets turned sinister this Halloween weekend.", "date": 1667120442000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-egypts-pound-sinks-further-095735042.html", "title": "UPDATE 1-Egypt's pound sinks further against dollar after flexibility pledge", "summary": "Egypt's pound fell about 4% to 24 against the dollar as trading resumed on Sunday, Refinitiv data showed, after authorities committed to a flexible exchange rate under an International Monetary Fund support deal.  The pound slid about 14.5% to 23 against the dollar on Thursday after they pledged a \"durably flexible\" exchange rate in conjunction with a staff-level agreement for a $3 billion IMF extended fund facility.  Egypt's currency has been held steady or allowed to depreciate only gradually following previous sharp devaluations in 2016 and this March.", "date": 1667123855000, "category": "Business", "tickers": ["USD=X", "GBP=X", "GBPUSD=X"]}
{"url": "https://finance.yahoo.com/news/cathay-pacific-resume-flights-using-091525365.html", "title": "Cathay Pacific to resume some flights in Russian airspace", "summary": "(Reuters) -Hong Kong's Cathay Pacific Airways Ltd will resume using Russian airspace on some flights, the Hong Kong-based airline said on Sunday, restarting flights it had stopped after Moscow invaded Ukraine in February.  Cathay Pacific will begin flying from New York to Hong Kong using the popular \"Polar route\" from November, the company told Reuters in an emailed statement.  Citing strong headwinds and payload issues affecting its flights from the East Coast of North America to Hong Kong, Cathay Pacific said it will overfly the far eastern part of Russia.", "date": 1667121325000, "category": "Business", "tickers": ["CPCAY"]}
{"url": "https://finance.yahoo.com/news/harvard-unc-race-cases-present-110000235.html", "title": "Harvard and UNC race cases present test for U.S. Supreme Court", "summary": "The U.S. Supreme Court is set to consider whether colleges may continue to use race as a factor in student admissions in two cases that give its conservative majority a chance to ban policies often employed to boost Black and Hispanic enrollment and perhaps overturn its own precedents allowing such practices.  The justices, confronting another contentious issue in U.S. American society, are scheduled to hear arguments on Monday in appeals by a group backed by a conservative activist of lower court rulings upholding affirmative action admissions policies at Harvard University and the University of North Carolina.", "date": 1667127600000, "category": "U.S.", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-qatarenergy-names-conocophilips-partner-105128099.html", "title": "UPDATE 1-QatarEnergy names ConocoPhilips partner for LNG expansion project", "summary": "QatarEnergy's chief executive on Sunday named ConocoPhillips as the third and final partner on the Gulf Arab state's North Field South expansion, part of the world's largest liquefied natural gas (LNG) project.  ConocoPhillips will have a 6.25% interest in the project, Saad al-Kaabi told a news conference.  State-owned QatarEnergy had already announced Shell and TotalEnergies as partners in the North Field South expansion and Kaabi said each would hold a 9.375% stake.", "date": 1667127088000, "category": "Business", "tickers": ["NG=F", "COP"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: UN Says Discussing Next Steps on Grain Corridor", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Kyiv’s allies, including the US, UK and EU, condemned Russia’s decision to exit a UN-brokered deal to allow the export of Ukrainian grain from three Blac", "date": 1667128020000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-chinese-cities-brace-wave-112341977.html", "title": "UPDATE 1-Chinese cities brace for wave of Foxconn workers from COVID-hit Zhengzhou", "summary": "Cities in central China hastily drew up plans to isolate migrant workers fleeing to their hometowns from a vast assembly facility of iPhone maker Foxconn in COVID-hit Zhengzhou, fearing they could trigger coronavirus outbreaks.  Zhengzhou, capital of central Henan province, reported 167 locally transmitted COVID-19 cases in the seven days to Oct. 29, up from 97 infections in the prior seven-day period.  Apple supplier Foxconn, based in Taiwan, currently has about 200,000 workers at its Zhengzhou complex and has not disclosed the number of infected workers, but said on Sunday that it would not stop workers from leaving.", "date": 1667129021000, "category": "World", "tickers": ["2317.TW"]}
{"url": "https://finance.yahoo.com/news/audi-supports-one-off-staff-113830118.html", "title": "Audi supports one-off staff payments over permanent wage hikes", "summary": "German carmaker Audi is in favour of offering employees one-off tax-free payments instead of permanent wage increases, its human resources director said, as unions across Europe's biggest economy demand higher wages in light of rising inflation.  Workers' purchasing power in Germany has already taken a hit, with consumer price inflation at 11.6% in October.  Employers, however, do not see much scope for wage increases due to the rising costs of material and energy.", "date": 1667129910000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-international-leaders-offer-condolences-085529471.html", "title": "UPDATE 2-Foreign leaders offer condolences over deadly South Korea crush", "summary": "Foreign leaders expressed condolences over the deadly crowd surge in Seoul's Itaewon district, with at least 24 foreign nationals from 14 countries among those killed in the crush in a nightspot popular with South Koreans and foreigners alike.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after the Halloween crush on Saturday night killed some 153 people.  Those who died included people from China, Iran, Russia, the United States, Australia, Uzbekistan, Vietnam, Kazakhstan, Austria, Sri Lanka, Thailand, Norway and France, Yonhap news agency reported.", "date": 1667120129000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-qatarenergy-names-conocophilips-partner-105128099.html", "title": "UPDATE 2-QatarEnergy names ConocoPhilips partner for LNG expansion project", "summary": "QatarEnergy's chief executive on Sunday named ConocoPhillips as the third and final partner on the Gulf Arab state's North Field South expansion, part of the world's largest liquefied natural gas (LNG) project.  ConocoPhillips will have a 6.25% interest in the project, Saad al-Kaabi told a news conference.  State-owned QatarEnergy had already announced Shell and TotalEnergies as partners in the North Field South expansion and Kaabi said each would hold a 9.375% stake.", "date": 1667127088000, "category": "Business", "tickers": ["NG=F", "COP"]}
{"url": "https://finance.yahoo.com/news/1-international-leaders-offer-condolences-085529471.html", "title": "UPDATE 3-Foreign leaders offer condolences over deadly South Korea crush", "summary": "Foreign leaders expressed condolences over the deadly crowd surge in Seoul's Itaewon district, with at least 20 foreign nationals from as many as a dozen countries among those killed in the crush in a popular nightspot.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after the Halloween crush on Saturday night killed some 153 people.  South Korea's Ministry of Interior and Safety put the total at 20 foreign nationals killed.", "date": 1667120129000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Turkey Says Grain Vessels Being Inspected", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Kyiv’s allies, including the US, UK and EU, condemned Russia’s decision to exit a UN-brokered deal to allow the export of Ukrainian grain from three Blac", "date": 1667132500000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/to-turn-twitter-around-musk-needs-to-win-back-trust-124331940.html", "title": "Elon Musk needs to win back everybody's trust to turn Twitter around", "summary": "Musk has to put in some work to get users and advertisers to trust him with Twitter's future.", "date": 1667133811000, "category": "Business", "tickers": ["TWTR", "TSLA"]}
{"url": "https://finance.yahoo.com/news/mcdonalds-customers-arent-pushing-back-higher-prices-124103810.html", "title": "McDonald's customers aren't pushing back on higher prices, analyst says", "summary": "McDonald's U.S. customer base is still lovin' the fast food chain, even with higher prices.", "date": 1667133663000, "category": "Business", "tickers": ["MCD"]}
{"url": "https://finance.yahoo.com/news/ecb-knot-favors-50-75-121107603.html", "title": "ECB’s Knot Favors 50 or 75 Basis-Point Rate Hike in December", "summary": "(Bloomberg) -- Sign up for the New Economy Daily newsletter, follow us @economics and subscribe to our podcast.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’European Central Bank Governing Council member Klaas Knot", "date": 1667131867000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/renault-backed-beyonca-ev-venture-124859715.html", "title": "Renault-backed Beyonca EV venture touts health monitoring, targets Audi in China", "summary": "Beyonca, a start-up founded by a group of former Volkswagen executives, plans to take on the likes of Audi and BMW in China from next year with a new premium electric vehicle, betting that features such as health monitoring will appeal to buyers.  Led by current Renault China CEO Soh Weiming and backed by Renault and Dongfeng Motor, two-year-old Beyonca plans to unveil its first production car in the first quarter of next year with deliveries from 2024, Soh told Reuters.", "date": 1667134139000, "category": "Business", "tickers": ["RNO.PA"]}
{"url": "https://finance.yahoo.com/news/south-africa-health-minister-hopes-for-more-pharma-investment-124748587.html", "title": "South Africa health minister hopes for more pharma investment", "summary": "The global inequity in vaccine distribution throughout the pandemic triggered calls for more decentralized manufacturing and distribution solutions, especially for low- and middle-income countries.", "date": 1667134068000, "category": "World", "tickers": ["EBS", "MRNA", "JNJ"]}
{"url": "https://finance.yahoo.com/news/perfect-storm-swirls-canadians-face-130000108.html", "title": "'Perfect storm' swirls as Canadians face hot inflation, rising rates", "summary": "At a warehouse on an industrial stretch in Ottawa, giant metal crates of donated groceries are piled high as volunteers sort canned goods, pasta and other foods to be distributed to pantries around the Canadian city.  Demand has surged 33% at the Ottawa Food Bank from pre-COVID-19 pandemic levels, with visits up as spiraling grocery, gas and rent prices, along with fast-rising borrowing costs, leave more Canadians struggling to make ends meet.  \"We are absolutely seeing more people,\" said Rachael Wilson, chief executive of the Ottawa Food Bank, adding the organization is now spending C$6 million ($4.4 million) a year on food, up from C$2 million pre-pandemic.", "date": 1667134800000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-polarized-brazil-votes-tense-131442283.html", "title": "UPDATE 1-Polarized Brazil votes in tense Bolsonaro vs Lula presidential runoff", "summary": "A polarized Brazilian electorate began casting votes on Sunday in a knife-edge presidential runoff that pits far-right incumbent President Jair Bolsonaro against leftist former leader Luiz Inacio Lula da Silva.  Lula promises more social and environmental responsibility, evoking the rising prosperity of his 2003-2010 presidency, before corruption scandals tarnished his Workers Party.  Some 120 million voters are expected to punch their choices into electronic voting machines that Bolsonaro has criticized without proof as fraud-prone, raising concern he may not concede defeat, following the example of his ideological ally, former U.S. President Donald Trump.", "date": 1667135682000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-says-recovers-drones-133748156.html", "title": "UPDATE 1-Russia says it recovers drones used in Black Sea fleet attack in Crimea", "summary": "Russia's defence ministry on Sunday said it had recovered and analysed the wreckage of drones used to attack ships of Russia's Black Sea Fleet in Crimea the day before, finding that the drones were equipped with Canadian-made navigation.  The ministry has said Ukraine attacked the Black Sea Fleet near Sevastopol with 16 drones early on Saturday, and that British navy \"specialists\" had helped coordinate what it called a terrorist attack, a claim Britain has denied.", "date": 1667137068000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Russia Says Drone May Have Come From Grain Ship", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Kyiv’s allies were quick to condemn Russia’s decision to exit a UN-brokered deal to allow the export of Ukrainian grain from three Black Sea port", "date": 1667136971000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/turkey-says-talks-underway-russia-135903955.html", "title": "Turkey Says Talks Underway With Russia on Ukraine Grain Deal", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Turkey is holding talks with Russia after Moscow pulled out of the July agreement to allow Ukrainian crop shipments, a pact seen as critical to a", "date": 1667138343000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/u-n-chief-delays-travel-142404393.html", "title": "U.N. chief delays travel to focus on Ukraine's Black Sea grain deal", "summary": "U.N. Secretary-General Antonio Guterres is \"deeply concerned\" about the Ukraine Black Sea grain deal and has delayed his travel to Algiers for the Arab League Summit by a day to focus on the issue, a U.N. spokesperson said on Sunday.  \"The Secretary-General continues to engage in intense contacts aiming at the end of the Russian suspension of its participation,\" U.N. spokesperson Stephane Dujarric said in a statement.  \"The same engagement also aims at the renewal and full implementation of the initiative to facilitate exports of food and fertilizer from Ukraine, as well as removing the remaining obstacles to the exports of Russian food and fertilizer,\" he said.", "date": 1667139844000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/suspension-bridge-collapses-india-hundreds-144445517.html", "title": "Suspension bridge collapses in India, hundreds fall in river - officials", "summary": "Hundreds of people fell into a river when a suspension bridge in India's western Gujarat state collapsed on Sunday, with several critically injured, officials said.  Footage broadcast by the channel showed people clinging onto the cables of the collapsed bridge as emergency teams sought to rescue them.", "date": 1667141085000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-suspension-bridge-collapses-india-151212655.html", "title": "UPDATE 1-Suspension bridge collapses in India, hundreds fall in river - officials", "summary": "Hundreds of people fell into a river when a suspension bridge in India's western Gujarat state collapsed on Sunday and a number of them have been hurt, officials said.  More than 400 people were on the bridge in the town of Morbi at the time and were plunged into the Machchu River, local TV channel Zee News said.  Prime Minister Narendra Modi, who is in his home state Gujarat for a three-day visit, said he has directed the state chief minister to mobilise teams urgently for the rescue operation.", "date": 1667142732000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/turkey-says-talks-underway-russia-135903955.html", "title": "Turkey Says Defense Minister in Talks on Ukraine Grain Deal", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTurkey is holding talks with Russia after Moscow pulled out of the July agreement to allow Ukrainian crop shipments, a pact seen as critical to alleviate", "date": 1667143706000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-suspension-bridge-collapses-india-151212655.html", "title": "UPDATE 2-Thirty killed in suspension bridge collapse in India-officials", "summary": "At least 30 people were killed and dozens critically injured when a suspension bridge in India's western Gujarat state collapsed on Sunday, two government officials said.  \"We can confirm that 30 people have lost their lives, many have been rescued from the river and some are still missing,\" said Amit Jhala, a senior administrator at the state-run hospital to where victims had been taken.  Footage broadcast by the TV channel showed dozens of people clinging onto the cables of the collapsed bridge as emergency teams struggled to rescue them.", "date": 1667142732000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/grain-market-braces-price-leap-154920755.html", "title": "Grain market braces for price leap as Black Sea corridor halted", "summary": "Wheat futures are expected to leap on Monday as Russia's withdrawal from a Black Sea corridor agreement puts Ukrainian exports at risk, analysts said.  Moscow suspended its participation in the Black Sea deal on Saturday, in response to what it called a major Ukrainian drone attack on its fleet in Russian-annexed Crimea.  Kyiv said Russia was making an excuse for a prepared exit from the accord while Washington accused Moscow of weaponising food.", "date": 1667144960000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/egypt-pound-hits-another-grim-154316809.html", "title": "Egypt’s Pound Hits Another Grim Milestone in Move to Flexibility", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchEgypt’s pound extended its losses to depreciate as far as 24 to the US dollar for the first time, as speculation whirled over where the currency will lev", "date": 1667144596000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/the-merits-of-diversification-were-on-full-display-last-week-161448281.html", "title": "The merits of diversification were on full display last week", "summary": "Stocks climbed last week, with the S&P 500 jumping 4%. The index is now up 9% from its October 12 closing low of 3,577.03 and down 19% from its January 3 closing high of 4,796.56.", "date": 1667146488000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-suspension-bridge-collapses-india-151212655.html", "title": "UPDATE 3-At least 40 killed in India bridge collapse - minister", "summary": "At least 40 people were killed when a pedestrian bridge in the western Indian state of Gujarat collapsed, plunging hundreds of people into a river, a state minister said.  More than 400 people were on the suspension bridge over the Machhu River in the town of Morbi at the time of the collapse, local TV channel Zee News said.  TV footage showed dozens of people clinging onto the cables and twisted remains of the collapsed bridge as emergency teams struggled to rescue them.", "date": 1667142732000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/food-inflation-has-gotten-out-of-control-chef-restaurateur-wolfgang-puck-162349319.html", "title": "Food inflation has \"gotten out of control\": Wolfgang Puck", "summary": "Wolfgang Puck says the luxury dining industry is feeling the pinch of inflation too.", "date": 1667147029000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Turkey Working to Salvage Grain Export Pact", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsRussia, without offering evidence, said one of the drones launched on Saturday may have come from a grain ship that was part of the Black Sea initiative.", "date": 1667146793000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-cricket-miller-fifty-powers-161854033.html", "title": "UPDATE 1-Cricket-Miller fifty powers South Africa to last-over win against India", "summary": "Fast bowler Lungi Ngidi decimated India's top order and David Miller blasted a vital fifty on Sunday as South Africa triumphed by five wickets against the 2007 champions in a low-scoring Twenty20 World Cup clash at Perth Stadium.  India recovered from losing four early wickets after winning the toss, guided by Suryakumar Yadav (68 off 40 balls) to a modest total of 133-9 in 20 overs.  South Africa responded by scoring 137-5 with two balls remaining, spearheaded by Miller's unbeaten 46-ball 59.", "date": 1667146734000, "category": "Sports", "tickers": []}
{"url": "https://finance.yahoo.com/news/halloween-movies-horror-films-post-pandemic-box-office-162921220.html", "title": "Halloween at the movies: How horror films have helped boost post-pandemic box office", "summary": "Horror films have jolted the post-pandemic box office.", "date": 1667147361000, "category": "Entertainment", "tickers": ["PARA", "PARAA", "PARAP"]}
{"url": "https://finance.yahoo.com/news/food-inflation-has-gotten-out-of-control-chef-restaurateur-wolfgang-puck-162349319.html", "title": "Wolfgang Puck: Food inflation has 'gotten out of control'", "summary": "Wolfgang Puck says the luxury dining industry is feeling the pinch of inflation too.", "date": 1667147029000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/senate-republicans-want-sec-explain-163811483.html", "title": "Senate Republicans want the SEC to explain why staff are quitting", "summary": "Senate Republicans want the SEC to explain why staff are leaving the nation's corporate watchdog at the highest rate in 10 years amid a flurry of proposed rules, according to a letter seen by Reuters on Sunday.  The private letter dated Oct. 27 from Senate Republicans to the chair of the Securities and Exchange Commission, Gary Gensler, adds to mounting criticism that the U.S. regulator lacks the internal firepower it needs to accomplish its ambitious rulemaking plans.  Gensler, a veteran Wall Street regulator who was chosen by President Joe Biden, a Democrat, has already clashed with Republicans over the watchdog's proposals on corporate climate-related disclosures.", "date": 1667147891000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/hsbcs-canada-unit-loses-national-163244037.html", "title": "HSBC's Canada unit loses National Bank, CIBC as bidders, Global and Mail reports", "summary": "National Bank of Canada and Canadian Imperial Bank of Commerce (CIBC) have dropped out as bidders for HSBC Holdings PLC's business in Canada, while Bank of Montreal is still pursuing the deal, according to a report in The Globe and Mail newspaper.  HSBC disclosed on Oct. 4 that it was considering selling HSBC Bank Canada, a unit that analysts estimate to be valued around C$8 billion ($5.88 billion) to C$10 billion ($7.35 billion).  The Globe and Mail, in its report on Friday, quoted sources familiar with the process as saying that the field of contenders to acquire HSBC Bank Canada from the British lender was narrowing.", "date": 1667147564000, "category": "Business", "tickers": ["HSBC", "CM"]}
{"url": "https://finance.yahoo.com/news/stock-market-week-ahead-jobs-report-fed-rate-decision-preview-october-30-170543034.html", "title": "Fed, jobs data to set groundwork for rest of 2022: What to know this week", "summary": "The Federal Reserve’s next policy move and a rush of employment data will headline a busy start to November on Wall Street this week.", "date": 1667149543000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/saudi-net-reserves-surge-near-162507709.html", "title": "Saudi Net Reserves Surge Near $449 Billion, Highest Since 2020", "summary": "(Bloomberg) -- Saudi Arabia’s net foreign assets rose to 1.69 trillion riyals ($448.8 billion) in September, the most in nearly two years, as high crude prices boosted the coffers of the world’s largest oil exporter.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsBad S&P 500 Ear", "date": 1667147107000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/walgreens-controlled-villagemd-said-explore-171747207.html", "title": "Walgreens-Controlled VillageMD Said to Explore Deal for Summit", "summary": "(Bloomberg) -- VillageMD, which is majority owned by Walgreens Boots Alliance Inc., is exploring a deal to merge with Warburg Pincus-backed Summit Health, according to people familiar with the matter. Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsBad S&P 500 Earnings Are Playi", "date": 1667150267000, "category": "Business", "tickers": ["WBA"]}
{"url": "https://finance.yahoo.com/news/russias-lavrov-needles-biden-over-175829523.html", "title": "Russia's Lavrov needles Biden over Cuban Missile Crisis and Ukraine", "summary": "President Vladimir Putin's foreign minister on Sunday needled Joe Biden over Ukraine, saying that he hoped the U.S. President had the wisdom to deal with a global confrontation similar to the 1962 Cuban Missile Crisis.  Russia's invasion of Ukraine has triggered the biggest confrontation between Moscow and the West since the Cuban crisis when the Soviet Union and United States are to considered to have come closest to nuclear war.", "date": 1667152709000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Kyiv Says 218 Grain Vessels Now Stuck in Place", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsBad S&P 500 Earnings Are Playing Right Into the Fed’s HandsRussia, without offering evidence, said one of the drones launched on Saturday may have come from a grain ship that was part of the Black Sea initiative. It", "date": 1667153707000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/soccer-rashford-header-enough-earn-181113176.html", "title": "Soccer-Rashford header enough to earn Manchester United battling win over West Ham", "summary": "A first-half header from Marcus Rashford, his 100th goal for Manchester United in all competitions, was enough to earn his side a 1-0 victory over West Ham United in the Premier League on Sunday.  After making a slow start to the match, United burst into life in the 38th minute when Rashford powered a bullet header into the net on the end of Christian Eriksen's sublime cross to give the home side the lead.  Veteran forward Cristiano Ronaldo, making just his third league start of the season, wasted a golden chance to double United's lead early in the second half, firing wide from a good position, before West Ham upped the ante.", "date": 1667153473000, "category": "Sports", "tickers": ["MANU"]}
{"url": "https://finance.yahoo.com/news/trade-brazil-assets-overseas-election-180445009.html", "title": "Here’s How to Trade Brazil Assets Overseas on Election Night", "summary": "(Bloomberg) -- Investors seeking to wager on Brazil after its presidential runoff vote can turn to Asia to place their first trades.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsBad S&P 500 Earnings Are Playing Right Into the Fed’s HandsThe Next Funds Ibovespa Linked ETF, a Ja", "date": 1667153085000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/jittery-stock-traders-eye-four-170007203.html", "title": "Jittery Stock Traders Eye Four Days That Will Sow Market’s Fate", "summary": "(Bloomberg) -- Investors just got over a hectic week, contending with a blitz of earnings from some of America’s biggest companies as well as a pile of uncertain economic and geopolitical news. But what’s coming may be even worse. Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchTesla Engineers Visit Twitter Office to Review Code for MuskPutin Stirs European Worry on Home Appliance Imports Stripped for Arms", "date": 1667149207000, "category": "Business", "tickers": ["^GSPC"]}
{"url": "https://finance.yahoo.com/news/turkey-says-talks-underway-russia-135903955.html", "title": "Turkey, UN Try to Save Ukraine Grain Export Deal as Russia Quits", "summary": "(Bloomberg) -- Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsTesla Engineers Visit Twitter Office to Review Code for MuskBad S&P 500 Earnings Are Playing Right Into the Fed’s HandsTurkey, the UN and others looked for ways to salvage the Ukrainian grain export initiative after Moscow said it would pull out indefinitely following an atta", "date": 1667154622000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-soccer-rashford-header-enough-182621439.html", "title": "UPDATE 1-Soccer-Rashford header enough to earn Manchester United battling win over West Ham", "summary": "A first-half header from Marcus Rashford, his 100th goal for Manchester United in all competitions, was enough to earn his side a 1-0 victory over West Ham United in the Premier League on Sunday.  After making a slow start to the match, United burst into life in the 38th minute when Rashford powered a bullet header into the net on the end of Christian Eriksen's sublime cross to give the home side the lead.  Veteran forward Cristiano Ronaldo, making just his third league start of the season, wasted a golden chance to double United's lead early in the second half, firing wide from a good position, before West Ham upped the ante.", "date": 1667154381000, "category": "Sports", "tickers": ["MANU"]}
{"url": "https://finance.yahoo.com/news/fresenius-medical-cuts-outlook-slower-171007471.html", "title": "Fresenius Medical cuts outlook on slower recovery, rising costs", "summary": "BERLIN (Reuters) -Kidney dialysis provider Fresenius Medical Care (FMC) on Sunday revised down its forecast for 2022, expecting net income to decline this year, dragged down by rising labour costs and a slower than expected recovery in North America business.  The company now expects net income to decline in the high-teens to mid-20s percentage range this year, down from its previous outlook of a high-teens percentage drop.", "date": 1667149807000, "category": "Business", "tickers": ["FMS"]}
{"url": "https://finance.yahoo.com/news/russias-lavrov-needles-biden-over-175829523.html", "title": "REFILE-Russia's Lavrov needles Biden over Cuban Missile Crisis and Ukraine", "summary": "President Vladimir Putin's foreign minister on Sunday needled Joe Biden over Ukraine, saying that he hoped the U.S. President had the wisdom to deal with a global confrontation similar to the 1962 Cuban Missile Crisis.  Russia's invasion of Ukraine has triggered the biggest confrontation between Moscow and the West since the Cuban crisis when the Soviet Union and United States are to considered to have come closest to nuclear war.", "date": 1667152709000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/bocs-macklem-no-threat-independence-190121061.html", "title": "BoC's Macklem: No threat to independence of Canada's central bank - report", "summary": "The Bank of Canada (BoC) has hiked interest rates by 350-basis points in just seven months, one of its sharpest tightening campaigns ever, to try to force inflation back down to its 2% target from 6.9% in September.  The combination of high interest rates and inflation has squeezed Canadian consumers and small businesses, prompting politicians, unions and even some economists to implore the central bank to slow its pace of tightening.  \"I do not have any concerns about the bank's independence being under threat,\" Macklem was quoted saying in an interview with The Canadian Press.", "date": 1667156481000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-soccer-rashford-header-enough-182621439.html", "title": "UPDATE 2-Soccer-Rashford header enough to earn Manchester United battling win over West Ham", "summary": "A first-half header from Marcus Rashford, his 100th goal for Manchester United in all competitions, was enough to earn his side a 1-0 victory over West Ham United in the Premier League on Sunday.  After making a slow start to the match, United burst into life in the 38th minute when Rashford powered a bullet header into the net on the end of Christian Eriksen's sublime cross to give the home side the lead.  Veteran forward Cristiano Ronaldo, making just his third league start of the season, wasted a golden chance to double United's lead early in the second half, firing wide from a good position, before West Ham upped the ante.", "date": 1667154381000, "category": "Sports", "tickers": ["MANU"]}
{"url": "https://finance.yahoo.com/news/australia-set-another-close-call-180000229.html", "title": "Australia Set for Another Close Call on Interest-Rate Decision", "summary": "(Bloomberg) -- Australia’s central bank faces a tough task in deciding whether to persist with smaller interest-rate increases or U-turning back to outsized hikes to try to gain control of hotter-than-expected inflation.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsTesla Engineers Visit Twitter Office to Review Code for MuskBad S&P 500", "date": 1667152800000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/fed-stocks-190800093.html", "title": "Fed up? Stocks up!", "summary": "If world markets on Monday take their cue from Friday's melt up on Wall Street it will round off what has, in many ways, been a truly remarkable month.  Investors face another (likely) bumper U.S. rate hike from the Fed later this week, and profit-taking and re-positioning as the new month begins could also burst the revival bubble.  The implied Fed terminal rate rose around 50 bps to 5% (also Goldman's new forecast), bond yields rose, global inflation remained sticky, 2023 recession risks increased, and the Q3 U.S. earnings season has been patchy at best, or a disaster at worst.", "date": 1667156880000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/stock-investor-guide-brazil-presidential-130041613.html", "title": "A Stock Investor’s Guide to Brazil’s Presidential Runoff Vote", "summary": "(Bloomberg) -- Brazilian stocks have outperformed global peers this year, and investors say more gains are likely as neither candidate vying for the presidency in Sunday’s decisive runoff vote is expected to jeopardize the country’s fiscal outlook in the short term. Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsTesla Engineers Visit Tw", "date": 1667156717000, "category": "Business", "tickers": ["PBR-A"]}
{"url": "https://finance.yahoo.com/news/morning-bid-fed-stocks-190000167.html", "title": "MORNING BID-Fed up? Stocks up!", "summary": "A look at the day ahead in Asian markets from Jamie McGeever If world markets on Monday take their cue from Friday's melt up on Wall Street it will round off what has, in many ways, been a truly remarkable month.  Investors face another (likely) bumper U.S. rate hike from the Fed later this week, and profit-taking and re-positioning as the new month begins could also burst the revival bubble.  The implied Fed terminal rate rose around 50 bps to 5% (also Goldman's new forecast), bond yields rose, global inflation remained sticky, 2023 recession risks increased, and the Q3 U.S. earnings season has been patchy at best, or a disaster at worst.", "date": 1667156400000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/royal-mail-workers-union-withdraws-190825443.html", "title": "Royal Mail workers' union withdraws November strike plan in UK", "summary": "The company and the union have talks planned through the Advisory, Conciliation and Arbitration Service (Acas) on Monday.  Royal Mail has been in a tussle with the CWU over pay for months and has said it is losing 1 million pounds ($1.11 million) a day due to strike action.", "date": 1667156905000, "category": "World", "tickers": ["ROYMY"]}
{"url": "https://finance.yahoo.com/news/1-russias-lavrov-needles-biden-192959057.html", "title": "UPDATE 1-Russia's Lavrov needles Biden over Cuban missile crisis and Ukraine", "summary": "President Vladimir Putin's foreign minister on Sunday needled Joe Biden over Ukraine, saying that he hoped the U.S. president had the wisdom to deal with a global confrontation similar to the 1962 Cuban missile crisis.  Russia's invasion of Ukraine has triggered the biggest confrontation between Moscow and the West since the Cuban crisis when the Soviet Union and United States came close to nuclear war.", "date": 1667158199000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-hsbcs-canada-unit-loses-193839110.html", "title": "UPDATE 1-HSBC's Canada unit loses National Bank, CIBC as bidders, Global and Mail reports", "summary": "National Bank of Canada and Canadian Imperial Bank of Commerce (CIBC) have dropped out as bidders for HSBC Holdings PLC's business in Canada, while Bank of Montreal is still pursuing the deal, according to a report in The Globe and Mail newspaper.  HSBC disclosed on Oct. 4 that it was considering selling HSBC Bank Canada, a unit that analysts estimate to be valued at around C$8 billion ($5.88 billion) to C$10 billion ($7.35 billion).  The Globe and Mail, in its report on Friday, quoted sources familiar with the process as saying that the field of contenders to acquire HSBC Bank Canada from the British lender was narrowing.", "date": 1667158719000, "category": "Business", "tickers": ["HSBC"]}
{"url": "https://finance.yahoo.com/news/soccer-ten-hag-hopes-magnificent-200012471.html", "title": "Soccer-Ten Hag hopes 'magnificent' De Gea stays on at Manchester United", "summary": "Manchester United manager Erik ten Hag said he hoped \"magnificent\" goalkeeper David de Gea would stay beyond this season at the club after seeing the Spaniard play a starring role in his side's 1-0 win over West Ham United on Sunday.  De Gea produced three stunning saves in the second half to help United stretch their unbeaten run to eight in all competitions and earn a victory that moved them up to fifth in the Premier League.", "date": 1667160012000, "category": "Sports", "tickers": ["MANU"]}
{"url": "https://finance.yahoo.com/news/brazil-highway-police-blockades-fan-195323938.html", "title": "Brazil highway police blockades fan voter-suppression fears", "summary": "Widespread allegations of illegal roadblocks by Brazil's Federal Highway Police (PRF) in the poor northeast of Brazil sparked fears of potential vote suppression that could benefit far-right President Jair Bolsonaro in Sunday's tense runoff election.  Brazilians cast their votes on Sunday in a fraught second-round vote between Bolsonaro and leftist rival Luiz Inacio Lula da Silva.", "date": 1667159603000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/thermo-fisher-said-near-2-194624952.html", "title": "Thermo Fisher Said to Near $2.3 Billion Deal for Binding Site", "summary": "(Bloomberg) -- Thermo Fisher Scientific Inc. is nearing a deal to acquire Birmingham, England-based diagnostic firm Binding Site for more than £2 billion ($2.3 billion) from private equity fund Nordic Capital, according to people familiar with the matter. Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsTesla Engineers Visit Twitter Offic", "date": 1667159184000, "category": "Business", "tickers": ["TMO"]}
{"url": "https://finance.yahoo.com/news/soccer-arsenal-beat-west-ham-205328033.html", "title": "Soccer-Arsenal beat West Ham but Manchester United go top of WSL", "summary": "Arsenal came back from a goal down to beat West Ham United 3-1 on Sunday, but it was not enough to dislodge Manchester United, who top the Women's Super League table after a 3-0 win over Everton earlier in the day.  United, Arsenal and Chelsea, who beat Aston Villa 3-1 on Sunday, all have 15 points but the Red Devils lead the standings thanks to their superior goal difference.", "date": 1667163208000, "category": "Sports", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-nzs-central-bank-says-205211000.html", "title": "UPDATE 1-NZ's central bank says banks likely to withstand stagflation", "summary": "The Reserve Bank of New Zealand said on Monday its annual stress test on the banking sector showed banks were \"well placed\" to overcome stagflation.  The RBNZ's Deputy Governor Christian Hawkesby said while banks' capital buffers would take a hit in a stagflation scenario, where high inflation is paired with negative economic growth, they would remain well above the regulatory minimums.  Hawkesby said that this was thanks in part to the build-up of capital since the 2008 global financial crisis.", "date": 1667163131000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/world-food-security-stake-russia-203940797.html", "title": "The World’s Food Security Is at Stake as Russia Exits Grain Deal", "summary": "(Bloomberg) -- Traders are bracing for a fresh spike in grain prices after Russia’s exit from a deal allowing Ukraine crops to move from the Black Sea to the countries most in need of them roils markets anew.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsTesla Engineers Visit Twitter Office to Review Code for MuskEXPLAINER: How And Why", "date": 1667162380000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-tusimple-probed-fbi-sec-205932381.html", "title": "UPDATE 1-TuSimple probed by FBI, SEC over ties to Chinese startup- WSJ", "summary": "Self-driving truck startup TuSimple Holdings Inc is being investigated by the FBI, U.S. Securities and Exchange Commission (SEC) and Committee on Foreign Investment about its relationship with China-backed Hydron Inc, the Wall Street Journal reported on Sunday.  The officials are looking at whether TuSimple and its executives, specially Chief Executive Xiaodi Hou, breached fiduciary duties and securities laws by failing to properly disclose the relationship with Hydron, the WSJ said, citing people familiar with the matter.", "date": 1667163572000, "category": "Business", "tickers": ["TSP"]}
{"url": "https://finance.yahoo.com/news/tusimple-probed-fbi-sec-over-201603623.html", "title": "TuSimple probed by FBI, SEC over ties to Chinese startup - WSJ", "summary": "The officials are looking at whether TuSimple and its executives, specially Chief Executive Xiaodi Hou, breached fiduciary duties and securities laws by failing to properly disclose the relationship with Hydron, the WSJ said, citing people familiar with the matter.  They are also trying to find out whether TuSimple shared intellectual property developed in the United States with Hydron and whether that action defrauded TuSimple investors by sending valuable technology to an overseas adversary, the newspaper said.", "date": 1667160963000, "category": "Business", "tickers": ["TSP"]}
{"url": "https://finance.yahoo.com/news/zelenskiy-ukrainian-forces-repel-offensive-205513880.html", "title": "Zelenskiy: Ukrainian forces repel offensive in Donetsk region", "summary": "Ukrainian President Volodymyr Zelenskiy said on Sunday that  Ukrainian forces had repelled a \"fierce offensive\" by Russian troops in the eastern Donetsk region.  Zelenskiy said a military unit from Chop in western Ukraine had undertaken the action, but did not say where the clash had occurred.  \"Today they stopped the fierce offensive actions of the enemy,\" Zelenskiy said in his nightly address.", "date": 1667163313000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-musk-denies-reports-firing-220330961.html", "title": "UPDATE 1-Musk denies reports he is firing Twitter employees in attempt to avoid payouts", "summary": "Twitter's new owner Elon Musk has denied a New York Times report about laying off Twitter employees at a date earlier than Nov. 1 to avoid stock grants due on the day.  In a response to a Twitter user asking about the layoffs, Musk tweeted: \"This is false.\"  The New York Times reported on Saturday that Musk has ordered job cuts across the company, with some teams to be trimmed more than others and that layoffs would take place before Nov. 1 date, when employees were scheduled to receive stock grants as part of their compensation.", "date": 1667167410000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/elon-musk-deletes-tweet-unfounded-220324315.html", "title": "Elon Musk deletes tweet with unfounded theory about Pelosi attack", "summary": "Twitter's new owner Elon Musk appeared to have deleted a tweet posted on Sunday referencing an unfounded theory regarding the attack on the husband of U.S. House Speaker Nancy Pelosi at their San Francisco home.  The since-deleted tweet was in response to one by former Secretary of State Hillary Clinton, who blamed the attack on hateful rhetoric by the Republican Party and linked to an L.A. Times story about how the suspect promoted far-right conspiracy theories online.  \"There is a tiny possibility there might be more to this story than meets the eye,\" Musk replied to Clinton, linking to a site called the Santa Monica Observer that fact-checkers have described as a purveyor of hoaxes, including that Clinton herself had died and been replaced by a body double.", "date": 1667167404000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/dollar-rises-futures-suggest-gains-214405075.html", "title": "Dollar Rises, Futures Suggest Gains in Asia Stocks: Markets Wrap", "summary": "(Bloomberg) -- The dollar rose while Asian equity futures pointed to gains in the region’s stocks at the start of a pivotal week for markets that will see interest rate decisions from central banks including the Federal Reserve.Most Read from BloombergGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsEXPLAINER: How And Why Do Crowd Surges Turn Deadly?Tesla Engine", "date": 1667166245000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/dollar-rises-futures-suggest-gains-214405075.html", "title": "Dollar Rises, Stock Futures Mixed in Cautious Open: Markets Wrap", "summary": "(Bloomberg) -- The dollar rose while equity futures gave mixed signals at the start of a pivotal week for markets that will see interest rate decisions from central banks including the Federal Reserve.Most Read from BloombergGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsEXPLAINER: How And Why Do Crowd Surges Turn Deadly?Tesla Engineers Visit Twitter Office to", "date": 1667168629000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/australia-set-another-close-call-180000229.html", "title": "Australia Set for Another Close Call Interest-Rate Decision", "summary": "(Bloomberg) -- Australia’s central bank faces a tough task in deciding whether to persist with smaller interest-rate increases or U-turning back to outsized hikes to try to gain control of hotter-than-expected inflation.Most Read from BloombergGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsEXPLAINER: How And Why Do Crowd Surges Turn Deadly?Tesla Engineers Visi", "date": 1667170105000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: UN Says Food Vessels to Resume Moving on Monday", "summary": "(Bloomberg) -- Most Read from BloombergGoldman Sachs Now Sees Fed Rates Peaking at 5% in MarchSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesPutin Stirs European Worry on Home Appliance Imports Stripped for ArmsEXPLAINER: How And Why Do Crowd Surges Turn Deadly?Tesla Engineers Visit Twitter Office to Review Code for MuskUkrainian food shipments are set to resume moving through a maritime corridor on Monday, challenging Russia’s decision to back out of a safe-passage deal for Ukraine", "date": 1667169902000, "category": "World", "tickers": []}
