{"url": "https://finance.yahoo.com/news/1-u-n-mulls-sending-124323432.html", "title": "UPDATE 1-As U.N. mulls sending troops to Haiti, a gang's rise shows how hard that would be", "summary": "As Haiti's gang-induced humanitarian crisis deepened in October, a group of looters ransacked a supermarket in a well-to-do suburb of the capital Port-au-Prince, leading police to arrest over a dozen people and take them to a nearby police station.  Within hours, the station in the area known as Thomassin came under a hail of bullets from gang members led by a man named Carlo Petithomme, whose brother had been among those arrested, according to two security sources.  Petithomme goes by the alias Ti Makak, and leads a gang of the same name.", "date": 1667047403000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/britain-denies-russian-claims-navy-124711989.html", "title": "Britain denies Russian claims that its navy personnel blew up Nord Stream gas pipelines", "summary": "Britain on Saturday denied Russian claims that British navy personnel blew up the Nord Stream gas pipelines last month, calling them \"false claims of an epic scale\".  \"To detract from their disastrous handling of the illegal invasion of Ukraine, the Russian Ministry of Defence is resorting to peddling false claims of an epic scale,\" a spokesperson for Britain's ministry of defence said.", "date": 1667047631000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-says-uk-navy-110522580.html", "title": "UPDATE 4-Russia says UK navy blew up Nord Stream, London denies involvement", "summary": "Russia's defence ministry said on Saturday that British navy personnel blew up the Nord Stream gas pipelines last month, a claim that London said was false and designed to distract from Russian military failures in Ukraine.  Russia did not give evidence for its claim that a leading NATO member had sabotaged critical Russian infrastructure amid the worst crisis in relations between the West and Russia since the depths of the Cold War.", "date": 1667041522000, "category": "World", "tickers": ["NG=F"]}
{"url": "https://finance.yahoo.com/news/twitter-frees-billions-arbitrage-traders-121500535.html", "title": "Twitter Frees Up Billions for Arbitrage Traders Seeking Next Win", "summary": "(Bloomberg) -- Billions of dollars in arbitrage capital is looking for a new home after Elon Musk finally closed his $44 billion deal to buy Twitter Inc.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainTwitter CEO Among Top Executives Departing as Musk Takes OverFed Seen Aggressively Hiking to 5%, Triggering Global RecessionMerger", "date": 1667045700000, "category": "Business", "tickers": ["TWTR", "VMW", "ATVI", "MSFT"]}
{"url": "https://finance.yahoo.com/news/ukraine-questions-twitter-takeover-amid-142107523.html", "title": "Ukraine questions Twitter takeover amid precarious ties with Musk", "summary": "A senior Ukrainian official expressed scepticism on Saturday about the takeover of Twitter by Elon Musk, whose relations with Kyiv have been precarious since the billionaire suggested in early October Ukraine should give up occupied land for peace.  Musk, a self-declared \"free speech absolutist\", has expressed desire to shake up Twitter's content moderation, and tweeted that \"the bird is freed\" after completing the purchase.  He pointed to Musk's \"unusual moderation\" of the site.", "date": 1667053267000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/microbetting-mlb-engage-fans-in-new-ways-142059807.html", "title": "'Holy grail': Microbetting is helping the MLB engage fans in new ways", "summary": "Microbetting, the practice of wagering on the outcome of a minor portion of a game like a specific pitch being a ball or strike, is surging in baseball.", "date": 1667053259000, "category": "Sports", "tickers": ["DKNG"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Says UK Involved in Naval Vessel Strike", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia’s Defense Ministry said a navy minesweeper received minor damage from a “massive” drone strike on its Black Sea fleet in Crimea, and accu", "date": 1667053924000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/strong-dollar-seen-hurting-us-131500648.html", "title": "Strong Dollar Seen Hurting US Outlook and Even Tilting Fed Path", "summary": "(Bloomberg) -- A strong dollar is likely to weigh negatively on the US economic outlook and could alter how high the Federal Reserve ultimately raises interest rates, economists surveyed by Bloomberg said.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Amo", "date": 1667049300000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Grain Safe-Transit Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will halt its participation in the safe-transit deal for Ukrainian grain exports from three Black Sea ports, Interfax reported, citing a", "date": 1667055603000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/tesla-and-argo-ai-setbacks-sap-momentum-for-driverless-tech-145810140.html", "title": "Tesla and Argo AI setbacks sap momentum for driverless tech", "summary": "Pump the brakes. Take the air out of the tires. Stuck in reverse.\nWhatever automotive cliche you want to use, this week the driverless tech industry took a big blow.", "date": 1667055490000, "category": "Business", "tickers": ["F", "GM", "TSLA", "GOOG", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 1-Russia suspends participation in deal on Ukraine grain exports", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports following attacks on ships in Crimea, TASS quoted the defence ministry as saying on Saturday.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the \"grain corridor\", the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/u-n-touch-russia-ukraine-151557251.html", "title": "U.N. in touch with Russia about Ukraine grain deal suspension", "summary": "The United Nations is in contact with Russian authorities following reports Moscow has suspended participation in a deal that resumed Ukrainian Black Sea grain and fertilizer exports, a U.N. spokesman said on Saturday.  \"It is vital that all parties refrain from any action that would imperil the Black Sea Grain Initiative which is a critical humanitarian effort that is clearly having a positive impact on access to food for millions of people around the world,\" U.N. spokesman Stephane Dujarric said.", "date": 1667056557000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 2-Russia suspends participation in Ukraine grain exports deal", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports after attacks on ships in Crimea, Russia's defence ministry said on Saturday, dealing a blow to a three-month agreement aimed at easing a global squeeze on grain supplies.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the 'grain corridor', the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 3-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsular with 16 drones in the early hours of Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/biden-cast-early-vote-along-163347997.html", "title": "Biden to cast early vote, along with granddaughter, a first-time voter", "summary": "U.S. President Joe Biden will cast an early vote in the crucial Nov 8 midterm elections on Saturday, joined by his granddaughter Natalie, a first-time voter, as Democrats fight for every vote.  Polls suggest Democrats could lose control of both houses of Congress, with voter discontent over high inflation spoiling the momentum Democrats had hoped to win from a bitter fight with Repubicans over abortion rights.  Voter turnout - usually far lower in midterm elections than in presidential ballot years - will be a critical factor in battleground states, and Democrats are urging voters to cast their ballots early.", "date": 1667061227000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Black Sea Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667061825000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 3-At least 59 dead, 150 injured in Halloween stampede in South Korea", "summary": "At least 59 people were killed and 150 injured in a stampede after a crowd poured into a central district of the South Korean capital Seoul for Halloween festivities on Saturday night, a fire official said.  A large number of people fell down in a narrow alley during the Halloween events, Choi Sung-beom, head of the Yongsan Fire Station, said.  \"The area is still chaotic so we are still trying to figure out the exact number of people injured,\" Moon Hyun-joo, an official at the National Fire Agency said.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ice-takes-11-billion-write-down-for-stake-in-crypto-platform-bakkt-175824568.html", "title": "ICE takes $1.1 billion write-down for stake in crypto platform Bakkt", "summary": "Intercontinental Exchange (ICE) is taking a $1.1 billion write off for its holdings of crypto platform Bakkt according to an SEC filing late Friday afternoon.", "date": 1667066304000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Good News: Bad S&P 500 Earnings Are Playing Into the Fed’s Hand", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-dogecoin-surges-elon-musks-184538315.html", "title": "UPDATE 1-Dogecoin surges on Elon Musk's Twitter deal", "summary": "The Tesla Inc CEO, a vocal proponent of cryptocurrencies, has heavily influenced prices of dogecoin and bitcoin.  Tesla started accepting dogecoin as payment for its merchandise early this year, and Musk's newly launched perfume brand can also be bought with dogecoin.", "date": 1667069138000, "category": "Business", "tickers": ["TSLA"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 4-At least 120 killed in Halloween stampede in South Korea", "summary": "At least 120 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 100 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 4-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsula with 16 drones early on Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Bad S&P 500 Earnings Are Playing Right Into the Fed’s Hands", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 5-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 6-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Condemned for Halting Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667073078000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 7-At least 146 killed in stampede at Halloween event in South Korea", "summary": "At least 146 people were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/russia-suspends-ukraine-grain-export-201215135.html", "title": "Russia Suspends Ukraine Grain Export Deal Indefinitely", "summary": "(Bloomberg) -- Russia pulled out of a deal to allow Ukrainian grain exports from Black Sea ports after drone strikes against its naval vessels, a move that threatens to exacerbate the global food crisis and send prices soaring again.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Glo", "date": 1667074335000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/russia-suspends-ukraine-grain-export-201215135.html", "title": "Russia Suspends Ukraine Grain Export Deal; Biden Slams Move", "summary": "(Bloomberg) -- Russia pulled out of a deal to allow Ukrainian grain exports from Black Sea ports after drone strikes against its naval vessels, a move that threatens to exacerbate the global food crisis and send prices soaring again.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Glo", "date": 1667076766000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/fed-boe-prepare-75-basis-200000212.html", "title": "Fed and BOE Prepare 75 Basis-Point Salvos on Inflation: Eco Week", "summary": "(Bloomberg) -- The Federal Reserve and the Bank of England may both unleash 75 basis-point interest-rate hikes in the coming days in a show of aggression toward inflation, even in the face of mounting recession risks.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwi", "date": 1667073600000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 5-Russia halts Ukraine Black Sea grain exports, Biden outraged", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  U.S. President Joe Biden denounced the move as \"purely outrageous\" and said it would increase starvation.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverPresident Joe Biden denounced Russia’s announcement that it was pulling out of a UN-brokered deal to allow the export of grain from Ukraine as “", "date": 1667077675000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 8-At least 149 killed in stampede at Halloween event in South Korea", "summary": "At least 149 people were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a nightlife area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/treasury-market-rally-faces-reality-200000035.html", "title": "Treasury Market Rally Faces Reality Check as Powell Sets Path", "summary": "(Bloomberg) -- The optimism that has crept into the US bond market is about to be put to the test. Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesFed Seen Aggressively Hiking to 5%, Triggering Global RecessionMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainTwitter CEO Among Top Executives Departing as Musk Takes OverThe Treasury market rallied this week, snapping a 12-week lo", "date": 1667073600000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-biden-casts-early-vote-215941277.html", "title": "UPDATE 1-Biden casts early vote, vows to visit more states in coming days", "summary": "U.S. President Joe Biden cast an early vote in the crucial Nov. 8 midterm elections on Saturday, joined by his granddaughter Natalie, a first-time voter, and said he would visit more states in coming days to help Democrats fight for every possible vote.  Polls suggest Democrats could lose control of both houses of Congress, with voter discontent over high inflation spoiling the momentum Democrats had hoped to win from a bitter fight with Republicans over abortion rights.  \"I'm feeling good,\" Biden told reporters after voting and speaking briefly with an elderly woman in a wheelchair.", "date": 1667080781000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 9-Halloween stampede in Seoul leaves at least 149 dead", "summary": "At least 149 people, mostly teenagers and young adults in their 20s, were killed in a crush when a huge crowd celebrating Halloween surged into an alley in a nightlife area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 65 people were injured in the melee in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  It was the first Halloween event in Seoul in three years after the country lifted COVID restrictions and social distancing.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/uk-companies-see-tough-conditions-230251317.html", "title": "UK companies see tough conditions enduring in months ahead: CBI", "summary": "British businesses think the gloom hanging over their prospects will persist in the coming months, according to an industry survey published on Sunday.  The Confederation of British Industry's (CBI) gauge of private sector growth in the three months to October rose to -15 from -19 in the three months to September, still in contraction territory.  For the next three months, services and distribution companies expect a further downturn, although manufacturers were more optimistic.", "date": 1667084571000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/traveller-fined-refused-entry-australia-234752858.html", "title": "Traveller fined, refused entry to Australia for 'significant' biosecurity breach", "summary": "An international traveller has been fined and refused entry to Australia after trying to bring meat into the country in what the government said on Sunday was a \"significant breach\" of biosecurity laws to protect Australia from foot and mouth disease.  In a statement, Agriculture Minister Murray Watt and Home Affairs Minister Clare O'Neil said the traveller had been fined $2,664 and blocked from entering Australia after attempting to bring 6 kilograms of meat products into the country.", "date": 1667087272000, "category": "World", "tickers": ["FC=F", "LC=F"]}
{"url": "https://finance.yahoo.com/news/china-southern-cancels-planned-return-235905890.html", "title": "China Southern cancels planned return of Boeing 737 MAX flights -website", "summary": "China Southern Airlines Co Ltd has cancelled plans for two Boeing Co 737 MAX flights on Sunday that would have represented the model's return to passenger flying in China after more than three years, according to the airline's website.  The 737 MAX was grounded in March 2019 following fatal crashes in Indonesia and Ethiopia but has returned to service around the world with the exception of China and Russia after modifications to the aircraft and pilot training.  China Southern had scheduled flights from its Guangzhou hub to Zhengzhou and Wuhan, Reuters reported on Thursday.", "date": 1667087945000, "category": "Business", "tickers": ["ZNH", "BA"]}
{"url": "https://finance.yahoo.com/news/yoon-declares-mourning-south-korea-013823920.html", "title": "Yoon declares mourning for South Korea after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims and wishes for a speedy recovery to the injured.  A huge crowd celebrating in the popular Itaewon district surged into an alley on Saturday night, emergency officials said, adding the death toll could rise.", "date": 1667093903000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 1-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"  Choi Sung-beom, head of the Yongsan Fire Station, said 151 deaths had been confirmed, including 19 foreigners.", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 2-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims, mostly teenagers and people in their 20s, and his wishes for a speedy recovery to the many injured.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/china-central-bank-reaffirms-step-032535002.html", "title": "China central bank reaffirms it will step up support for real economy", "summary": "China's central bank will step up credit support for the real economy while keeping the yuan basically steady, Governor Yi Gang said in comments published on Sunday, reaffirming the bank's existing policy objectives.  \"We will keep liquidity reasonably ample, increase credit support to the real economy,\" Yi was quoted by a central bank statement as saying during a parliament session on Friday.  \"Going forward, China has the conditions to maintain a normal monetary policy as long as possible and maintain the stability of the currency's value.\"", "date": 1667100335000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/musk-fired-twitter-execs-attempt-043616179.html", "title": "Musk fired Twitter execs in attempt to avoid payouts, layoffs planned - reports", "summary": "Twitter's new owner Elon Musk fired top executives in an effort to avoid hefty severance payouts, while lining up other layoffs as soon as Saturday to avoid stock grants due on Nov. 1, according to media reports on Saturday.  Musk fired Twitter Chief Executive Parag Agrawal, Chief Financial Officer Ned Segal and legal affairs and policy chief Vijaya Gadde on completion of a high-profile $44 billion buyout of the social media platform on Thursday, people familiar with the matter told Reuters.  He had accused them of misleading him and Twitter investors over the number of fake accounts on the platform.", "date": 1667104576000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-macaus-mgm-cotai-casino-041142200.html", "title": "UPDATE 2-Macau's MGM Cotai casino locked down after dealer COVID case - media", "summary": "Macau's MGM Cotai casino, operated by MGM China, was locked down on Sunday morning after a dealer was found to be infected with COVID-19 in the world's biggest gambling hub, local publication Inside Asian Gaming reported.  The closure deals a blow to casino operators who have already been grappling with COVID restrictions for more than two and a half years.  Government health workers were at the MGM Cotai site with noone allowed to enter or exit the building, Inside Asian Gaming said.", "date": 1667103102000, "category": "World", "tickers": ["MCHVY"]}
{"url": "https://finance.yahoo.com/news/chinese-cities-brace-wave-foxconn-065754121.html", "title": "Chinese cities brace for wave of Foxconn workers from COVID-hit Zhengzhou", "summary": "Cities in central China hastily drew up plans to isolate migrant workers fleeing to their hometowns from a vast assembly facility of iPhone maker Foxconn in COVID-hit Zhengzhou city, fearing the returnees may trigger coronavirus outbreaks.  Zhengzhou, capital of Henan province, reported 167 locally transmitted COVID-19 cases in the seven days to Oct. 29, up from 97 infections in the prior seven-day period.  Taiwan-based Foxconn, which has about 300,000 workers in Zhengzhou, has not disclosed the number of infected workers.", "date": 1667113074000, "category": "World", "tickers": ["2317.TW"]}
{"url": "https://finance.yahoo.com/news/south-korea-halloween-disaster-leaves-065518917.html", "title": "South Korea Halloween disaster leaves desperate families seeking word of missing", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  \"No one is telling me the truth,\" said Aby, who has lived in Seoul with her son for 18 years.", "date": 1667112918000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/goldman-sachs-now-sees-fed-055400433.html", "title": "Goldman Sachs Now Sees Fed Rates Peaking at 5% in March", "summary": "(Bloomberg) -- Goldman Sachs Group Inc. economists said they now expect the US Federal Reserve to raise interest rates to 5%, higher than previously predicted.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’The centr", "date": 1667109240000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/wrapup-1-russia-halts-ukraine-071902662.html", "title": "WRAPUP 1-Russia halts Ukraine Black Sea grain exports, prompting food crisis concerns", "summary": "Russia pulled out of a key United Nations-brokered grain deal, provoking international outrage and dealing a blow to attempts to ease a global food crisis triggered by Moscow's invasion of Ukraine.  On Saturday Moscow said it was suspending participation in the Black Sea deal, which has sought to avert famine and tame inflation, in response to what it called a major Ukrainian drone attack on its fleet.", "date": 1667114342000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/russia-scolds-u-over-grain-070802016.html", "title": "Russia scolds U.S. over grain deal remarks", "summary": "Russia's ambassador to Washington scolded the United States on Sunday for making what he said were false assertions about Moscow's decision to suspend its participation in a U.N.-brokered Black Sea grain deal.  \"Washington's reaction to the terrorist attack on the port of Sevastopol is truly outrageous,\" Ambassador Anatoly Antonov said on Telegram.  \"All the indications that the British military specialists were involved in organizing the massive strike with the use of drones, are disregarded,\" Antonov said.", "date": 1667113682000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-china-passes-womens-protection-074506474.html", "title": "UPDATE 1-China passes new women's protection law, revamped for first time in decades", "summary": "China passed legislation on Sunday aimed at giving women more protection against gender discrimination and sexual harassment, days after the bill was submitted to the country's top legislature after a third revision and extensive public input.  The legislation comes as activists have expressed concern about increasing government rhetoric on the value of traditional women's roles, and what some see as setbacks for women's rights and more restrictive attitudes towards abortion.  It's not yet clear to what extent those more conservative attitudes will be reflected in the new law.", "date": 1667115906000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-macaus-mgm-cotai-casino-041142200.html", "title": "UPDATE 3-Macau's MGM Cotai casino locked down with guests, staff after COVID case", "summary": "MGM China's Cotai casino in Macau was locked down on Sunday after a dealer tested positive for COVID-19, city authorities in the world's biggest gambling hub said, ordering everyone inside to stay put until Nov 1.  The closure deals a blow to casino operators who have already been grappling with COVID restrictions for more than two and a half years.  Government health workers were at the MGM Cotai site with noone allowed to enter or exit the building, industry publication Inside Asian Gaming said.", "date": 1667103102000, "category": "World", "tickers": ["MCHVY"]}
{"url": "https://finance.yahoo.com/news/1-south-koreas-yoon-declares-020546085.html", "title": "UPDATE 3-South Korea's Yoon declares mourning period after Halloween crush kills 151", "summary": "South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in a packed nightlife area in Seoul.  Yoon expressed condolences to the victims, mostly teenagers and people in their 20s, and his wishes for a speedy recovery to the many injured in one of the South Korea's worst disasters and the world's worst stampedes in decades.  \"A tragedy and disaster that should not have happened took place in the heart of Seoul last night.\"", "date": 1667095546000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/goldman-sachs-sees-fed-rates-075832092.html", "title": "Goldman Sachs sees Fed rates peaking at 5% in March - Bloomberg News", "summary": "Goldman Sachs Group Inc's economists said the U.S. Federal Reserve could bump up interest rates to as high as 5% by March 2023, 25 basis points above its earlier predictions, Bloomberg News reported on Sunday.  Goldman Sachs Chief Executive Officer David Solomon last week said the U.S. Federal Reserve could hike rates beyond 4.5-4.75% if it does not see \"real changes in behaviour.\"  Federal Reserve's next meeting could shed light on how long it will stick to the aggressive monetary policies.", "date": 1667116712000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/halloween-parties-turned-deadly-popular-075522073.html", "title": "How Halloween parties turned deadly in popular Seoul district", "summary": "Young people flocking to Seoul's popular Itaewon district on Saturday for the first virtually unrestricted Halloween festivities in three years instead found themselves caught up in a deadly crush that killed at least 151 people.  The crowd of partiers, some still in their teens and many clad in Halloween costumes, was ready to enjoy the bars, nightclubs and restaurants where the revelry routinely spills over into narrow and often steep side streets.  But the intimacy of Itaewon's backstreets turned sinister this Halloween weekend.", "date": 1667116522000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/international-leaders-offer-condolences-over-080225419.html", "title": "International leaders offer condolences over deadly South Korea Halloween crush", "summary": "International leaders expressed condolences after at least 22 foreign nationals from 12 countries were among those killed in a deadly crowd surge in Seoul's Itaewon district, a popular nightlife spot for South Koreans and expatriates alike.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 151 people in the packed nightlife area.  At least four Chinese nationals were among those killed, Xinhua news agency reported, citing the Chinese embassy in Seoul.", "date": 1667116945000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-grain-prices-could-074304312.html", "title": "Ukraine Latest: Grain Prices Could Jump After Russian Deal Exit", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’Kyiv’s allies, including the US, UK and EU, condemned Russia’s decision to exit a UN-brokered deal to allow the export of Ukrainian grain from three Blac", "date": 1667115784000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/eleven-participants-believed-taking-part-080410071.html", "title": "Eleven participants believed to be taking part in Iraq’s wheat tender - traders", "summary": "Eleven participants were believed to be taking part in Iraq’s tender for 50,000 tonnes of wheat, traders said on Sunday adding that no purchase was yet made.  Viterra  is among the participants.  Volumes in Iraq's tenders are nominal and the country often buys more than sought in the tender.", "date": 1667117050000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/1-south-korean-halloween-crush-083239840.html", "title": "UPDATE 1-After South Korean Halloween crush, families seek missing, plan funerals", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  One person broke down and kneeled on the floor after speaking to some officials at the centre, according to a Reuters witness.", "date": 1667118759000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-china-names-chen-yixin-083034539.html", "title": "UPDATE 1-China names Chen Yixin as state security minister -parliament", "summary": "China has appointed Chen Yixin as state security minister, replacing Chen Wenqing who was promoted to oversee police, legal affairs and intelligence, the National People's Congress, or parliament, said on Sunday.  Chen Yixin, who was elected to the ruling Communist Party's Central Committee during its once-every-five-years congress this month, had been in charge of a campaign in recent years to purge corrupt security and legal officials.  Chen Wenqing, who was elevated to the ruling Communist Party's Politburo, has been named as party secretary of the Central Political and Legal Affairs Commission, China's top security post with oversight of the police, judges and spies.", "date": 1667118634000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-halloween-parties-turned-deadly-090042808.html", "title": "UPDATE 1-How Halloween parties turned deadly in popular Seoul district", "summary": "Young people flocking to Seoul's popular Itaewon district on Saturday for the first virtually unrestricted Halloween festivities in three years instead found themselves caught up in a deadly crush that killed at least 151 people.  The crowd of partiers, some still in their teens and many clad in Halloween costumes, was ready to enjoy the bars, nightclubs and restaurants where the revelry routinely spills over into narrow and often steep side streets.  But the intimacy of Itaewon's backstreets turned sinister this Halloween weekend.", "date": 1667120442000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-international-leaders-offer-condolences-085529471.html", "title": "UPDATE 1-International leaders offer condolences over deadly South Korea Halloween crush", "summary": "International leaders expressed condolences after at least 22 foreign nationals from 13 countries were among those killed in a deadly crowd surge in Seoul's Itaewon district, a popular nightlife spot for South Koreans and expatriates alike.  South Korea's President Yoon Suk-yeol declared a period of national mourning on Sunday after a Halloween crush killed some 153 people in the packed nightlife area.  Those killed in Saturday night's disaster included people from China, Iran, Russia, the United States, Australia, Uzbekistan, Vietnam, Kazakhstan, Austria, Sri Lanka, Thailand, Norway and France, Yonhap news agency reported.", "date": 1667120129000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/eu-urges-moscow-revoke-suspension-085255863.html", "title": "EU urges Moscow to revoke suspension of Ukraine grain deal", "summary": "The European Union on Sunday called on Russia to reverse its decision to pull out of a U.N.-brokered deal that enabled Ukrainian grain exports via the Black Sea amid a global food crisis.  \"Russia's decision to suspend participation in the Black Sea deal puts at risk the main export route of much needed grain and fertilisers to address the global food crisis caused by its war against Ukraine,\" EU foreign policy chief Josep Borrell said on Twitter.", "date": 1667119975000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/seoul-crush-hits-storied-itaewon-092227869.html", "title": "Seoul crush hits storied Itaewon nightlife district on verge of renewal", "summary": "With \"Hooker Hill\" and snaking alleyways of bars with signs like \"BADASS\" around the local landmark Hamilton Hotel, Seoul's Itaewon district was a symbol of freewheeling nightlife in the South Korean capital for decades, before tragedy struck.  Lee Sang-yoon, who runs a pub in the alley next to the Hamilton where the disaster took place, said it may prove a devastating blow for even those who adapted to change.  \"This happened right at the moment when we were about to rebound after being hammered by the pandemic,\" said Lee, who has operated Itaewon businesses for three decades.", "date": 1667121747000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/cathay-pacific-resume-flights-using-091525365.html", "title": "Cathay Pacific to resume some flights using Russian airspace - Bloomberg News", "summary": "Cathay Pacific will fly from New York to the Asian financial hub using the so-called 'Polar Route' from Nov. 1, the report said citing an emailed response from the airline to the agency.  The report further added that airline cited strong headwinds and payload issues affecting its flights from the east coast of North America, and said its aircraft will overfly the far eastern part of Russia.  Cathay Pacific said in March that it was not routing flights through Russia's airspace, avoiding the area after the invasion of Ukraine despite longer flight times.", "date": 1667121325000, "category": "Business", "tickers": ["CPCAY"]}
{"url": "https://finance.yahoo.com/news/job-markets-defying-central-bankers-081500801.html", "title": "Job Markets Are Defying Central Bankers’ Efforts to Cool Demand", "summary": "(Bloomberg) -- Robust labor markets are defying central bankers’ efforts to tamp down inflation and economists’ predictions that recession is just around the corner.Most Read from BloombergSeoul Stampede Leaves Over 150 Dead at Halloween FestivitiesTesla Engineers Visit Twitter Office to Review Code for MuskMusk’s Twitter Roils With Hate Speech as Trolls Test New LimitsMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesUkraine Latest: Biden Calls Russian Grain Blockade ‘Outrageous’The", "date": 1667117700000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-south-korean-halloween-crush-083239840.html", "title": "UPDATE 2-After South Korean Halloween crush, families seek missing, plan funerals", "summary": "In tears, Philomene Aby's hands shook as she asked workers at a South Korean community centre for any news of her 22-year-old son, missing in the wake of a crowd surge in Seoul that left at least 151 people dead on Saturday.  \"I called his number but ... he wasn't answering,\" Aby told Reuters while standing in the Hannam-dong Community Service Center, which became a makeshift missing persons facility in the wake of the disaster.  One person broke down and kneeled on the floor after speaking to some officials at the centre, according to a Reuters witness.", "date": 1667118759000, "category": "World", "tickers": []}
