{"url": "https://finance.yahoo.com/news/1-u-n-mulls-sending-124323432.html", "title": "UPDATE 1-As U.N. mulls sending troops to Haiti, a gang's rise shows how hard that would be", "summary": "As Haiti's gang-induced humanitarian crisis deepened in October, a group of looters ransacked a supermarket in a well-to-do suburb of the capital Port-au-Prince, leading police to arrest over a dozen people and take them to a nearby police station.  Within hours, the station in the area known as Thomassin came under a hail of bullets from gang members led by a man named Carlo Petithomme, whose brother had been among those arrested, according to two security sources.  Petithomme goes by the alias Ti Makak, and leads a gang of the same name.", "date": 1667047403000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/britain-denies-russian-claims-navy-124711989.html", "title": "Britain denies Russian claims that its navy personnel blew up Nord Stream gas pipelines", "summary": "Britain on Saturday denied Russian claims that British navy personnel blew up the Nord Stream gas pipelines last month, calling them \"false claims of an epic scale\".  \"To detract from their disastrous handling of the illegal invasion of Ukraine, the Russian Ministry of Defence is resorting to peddling false claims of an epic scale,\" a spokesperson for Britain's ministry of defence said.", "date": 1667047631000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-says-uk-navy-110522580.html", "title": "UPDATE 4-Russia says UK navy blew up Nord Stream, London denies involvement", "summary": "Russia's defence ministry said on Saturday that British navy personnel blew up the Nord Stream gas pipelines last month, a claim that London said was false and designed to distract from Russian military failures in Ukraine.  Russia did not give evidence for its claim that a leading NATO member had sabotaged critical Russian infrastructure amid the worst crisis in relations between the West and Russia since the depths of the Cold War.", "date": 1667041522000, "category": "World", "tickers": ["NG=F"]}
{"url": "https://finance.yahoo.com/news/twitter-frees-billions-arbitrage-traders-121500535.html", "title": "Twitter Frees Up Billions for Arbitrage Traders Seeking Next Win", "summary": "(Bloomberg) -- Billions of dollars in arbitrage capital is looking for a new home after Elon Musk finally closed his $44 billion deal to buy Twitter Inc.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainTwitter CEO Among Top Executives Departing as Musk Takes OverFed Seen Aggressively Hiking to 5%, Triggering Global RecessionMerger", "date": 1667045700000, "category": "Business", "tickers": ["TWTR", "VMW", "ATVI", "MSFT"]}
{"url": "https://finance.yahoo.com/news/ukraine-questions-twitter-takeover-amid-142107523.html", "title": "Ukraine questions Twitter takeover amid precarious ties with Musk", "summary": "A senior Ukrainian official expressed scepticism on Saturday about the takeover of Twitter by Elon Musk, whose relations with Kyiv have been precarious since the billionaire suggested in early October Ukraine should give up occupied land for peace.  Musk, a self-declared \"free speech absolutist\", has expressed desire to shake up Twitter's content moderation, and tweeted that \"the bird is freed\" after completing the purchase.  He pointed to Musk's \"unusual moderation\" of the site.", "date": 1667053267000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/microbetting-mlb-engage-fans-in-new-ways-142059807.html", "title": "'Holy grail': Microbetting is helping the MLB engage fans in new ways", "summary": "Microbetting, the practice of wagering on the outcome of a minor portion of a game like a specific pitch being a ball or strike, is surging in baseball.", "date": 1667053259000, "category": "Sports", "tickers": ["DKNG"]}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Says UK Involved in Naval Vessel Strike", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia’s Defense Ministry said a navy minesweeper received minor damage from a “massive” drone strike on its Black Sea fleet in Crimea, and accu", "date": 1667053924000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/strong-dollar-seen-hurting-us-131500648.html", "title": "Strong Dollar Seen Hurting US Outlook and Even Tilting Fed Path", "summary": "(Bloomberg) -- A strong dollar is likely to weigh negatively on the US economic outlook and could alter how high the Federal Reserve ultimately raises interest rates, economists surveyed by Bloomberg said.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Amo", "date": 1667049300000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Grain Safe-Transit Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will halt its participation in the safe-transit deal for Ukrainian grain exports from three Black Sea ports, Interfax reported, citing a", "date": 1667055603000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/tesla-and-argo-ai-setbacks-sap-momentum-for-driverless-tech-145810140.html", "title": "Tesla and Argo AI setbacks sap momentum for driverless tech", "summary": "Pump the brakes. Take the air out of the tires. Stuck in reverse.\nWhatever automotive cliche you want to use, this week the driverless tech industry took a big blow.", "date": 1667055490000, "category": "Business", "tickers": ["F", "GM", "TSLA", "GOOG", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 1-Russia suspends participation in deal on Ukraine grain exports", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports following attacks on ships in Crimea, TASS quoted the defence ministry as saying on Saturday.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the \"grain corridor\", the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/u-n-touch-russia-ukraine-151557251.html", "title": "U.N. in touch with Russia about Ukraine grain deal suspension", "summary": "The United Nations is in contact with Russian authorities following reports Moscow has suspended participation in a deal that resumed Ukrainian Black Sea grain and fertilizer exports, a U.N. spokesman said on Saturday.  \"It is vital that all parties refrain from any action that would imperil the Black Sea Grain Initiative which is a critical humanitarian effort that is clearly having a positive impact on access to food for millions of people around the world,\" U.N. spokesman Stephane Dujarric said.", "date": 1667056557000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 2-Russia suspends participation in Ukraine grain exports deal", "summary": "Russia has suspended participation in a U.N.-brokered deal to export agricultural produce from Ukrainian ports after attacks on ships in Crimea, Russia's defence ministry said on Saturday, dealing a blow to a three-month agreement aimed at easing a global squeeze on grain supplies.  Russia said that Ukrainian forces, with the help of drones, attacked ships from the Black Sea Fleet in Sevastopol, the biggest city in Russian-annexed Crimea, in the early hours of Saturday.  \"Taking into account... the terrorist act by the Kyiv regime with the participation of British experts against the ships of the Black Sea Fleet and civilian vessels involved in ensuring the security of the 'grain corridor', the Russian side suspends participation in the implementation of agreements on the export of agricultural products from Ukrainian ports,\" the ministry said in a statement.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 3-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsular with 16 drones in the early hours of Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/biden-cast-early-vote-along-163347997.html", "title": "Biden to cast early vote, along with granddaughter, a first-time voter", "summary": "U.S. President Joe Biden will cast an early vote in the crucial Nov 8 midterm elections on Saturday, joined by his granddaughter Natalie, a first-time voter, as Democrats fight for every vote.  Polls suggest Democrats could lose control of both houses of Congress, with voter discontent over high inflation spoiling the momentum Democrats had hoped to win from a bitter fight with Repubicans over abortion rights.  Voter turnout - usually far lower in midterm elections than in presidential ballot years - will be a critical factor in battleground states, and Democrats are urging voters to cast their ballots early.", "date": 1667061227000, "category": "Politics", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Pulls Out of Black Sea Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667061825000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 3-At least 59 dead, 150 injured in Halloween stampede in South Korea", "summary": "At least 59 people were killed and 150 injured in a stampede after a crowd poured into a central district of the South Korean capital Seoul for Halloween festivities on Saturday night, a fire official said.  A large number of people fell down in a narrow alley during the Halloween events, Choi Sung-beom, head of the Yongsan Fire Station, said.  \"The area is still chaotic so we are still trying to figure out the exact number of people injured,\" Moon Hyun-joo, an official at the National Fire Agency said.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ice-takes-11-billion-write-down-for-stake-in-crypto-platform-bakkt-175824568.html", "title": "ICE takes $1.1 billion write-down for stake in crypto platform Bakkt", "summary": "Intercontinental Exchange (ICE) is taking a $1.1 billion write off for its holdings of crypto platform Bakkt according to an SEC filing late Friday afternoon.", "date": 1667066304000, "category": "Business", "tickers": []}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Good News: Bad S&P 500 Earnings Are Playing Into the Fed’s Hand", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/1-dogecoin-surges-elon-musks-184538315.html", "title": "UPDATE 1-Dogecoin surges on Elon Musk's Twitter deal", "summary": "The Tesla Inc CEO, a vocal proponent of cryptocurrencies, has heavily influenced prices of dogecoin and bitcoin.  Tesla started accepting dogecoin as payment for its merchandise early this year, and Musk's newly launched perfume brand can also be bought with dogecoin.", "date": 1667069138000, "category": "Business", "tickers": ["TSLA"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 4-At least 120 killed in Halloween stampede in South Korea", "summary": "At least 120 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 100 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/1-russia-suspends-participation-deal-150535422.html", "title": "UPDATE 4-Russia halts Ukraine Black Sea grain exports, citing attack on Crimea", "summary": "Russia on Saturday suspended participation in a U.N.-brokered Black Sea grain deal after what it said was a major Ukrainian drone attack on its fleet in Crimea, dealing a blow to attempts to ease the global food crisis.  Russia's defence ministry said Ukraine attacked the Black Sea Fleet near Sevastopol on the annexed Crimean peninsula with 16 drones early on Saturday, and that British navy \"specialists\" had helped coordinate the \"terrorist\" attack.", "date": 1667055935000, "category": "World", "tickers": ["KW=F"]}
{"url": "https://finance.yahoo.com/news/good-news-bad-p-500-170000376.html", "title": "Bad S&P 500 Earnings Are Playing Right Into the Fed’s Hands", "summary": "(Bloomberg) -- Was it good or bad this week when Alphabet Inc. told investors that advertising demand that helped swell its top line 50% in two years is starting to soften? Depends on what you mean by bad, and rarely has an argument over definitions meant more for markets and the economy.Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses", "date": 1667062800000, "category": "Business", "tickers": ["^GSPC", "GOOGL"]}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 5-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/3-least-59-dead-150-154927286.html", "title": "UPDATE 6-At least 146 killed in Halloween stampede in South Korea", "summary": "At least 146 people were killed in a stampede when a huge crowd celebrating Halloween crammed into an alley in a night life area of the South Korean capital Seoul on Saturday night, emergency officials said.  A further 150 people were injured in the crush in Seoul's Itaewon district, Choi Sung-beom, head of the Yongsan Fire Station, said in a briefing at the scene.  Many of the party-goers were wearing masks and Halloween costumes.", "date": 1667058567000, "category": "World", "tickers": []}
{"url": "https://finance.yahoo.com/news/ukraine-latest-russia-signals-rapid-064333944.html", "title": "Ukraine Latest: Russia Condemned for Halting Grain Export Deal", "summary": "(Bloomberg) -- Most Read from BloombergTesla Engineers Visit Twitter Office to Review Code for MuskMusk Takes Twitter Helm, Enacts Sweeping Change as Deal ClosesMark Zuckerberg’s Wealth Wipeout Hits $100 Billion as Meta Misses AgainFed Seen Aggressively Hiking to 5%, Triggering Global RecessionTwitter CEO Among Top Executives Departing as Musk Takes OverRussia will “indefinitely” pull out of the safe-transit agreement for Ukrainian grain exports from three Black Sea ports following what it calle", "date": 1667073078000, "category": "World", "tickers": []}
